{"schedule":{"version":"1","conference":{"title":"Linuxwochen Wien 2016","start":"2016-04-28","end":"2016-04-30","daysCount":3,"timeslot_duration":"00:15","days":[{"index":0,"date":"2016-04-28","day_start":"2016-04-28T10:00:00+02:00","day_end":"2016-04-28T19:00:00+02:00","rooms":{"F0.01":[{"id":339,"guid":"b2b2dc79-f548-421c-8094-440eaa72cf2d","logo":null,"date":"2016-04-28T10:00:00+02:00","start":"10:00","duration":"00:15","room":"F0.01","slug":"LWW16_-_339_-_de_-_f0_01_-_201604281000_-_begrussung_-_georg_markus_kainz_-_christian_jeitler","title":"Begrüßung","subtitle":"","track":"Open Everything","type":"lecture","language":"de","abstract":"","description":"","persons":[{"id":2,"full_public_name":"Georg Markus Kainz"},{"id":3,"full_public_name":"Christian Jeitler"}],"links":[]},{"id":356,"guid":"35889206-1e7f-4668-a216-9ed65e4f9be6","logo":"/system/logos/356/medium/Eule.jpg?1454075388","date":"2016-04-28T10:15:00+02:00","start":"10:15","duration":"00:45","room":"F0.01","slug":"LWW16_-_356_-_de_-_f0_01_-_201604281015_-_software_qualitat_ist_wie_schonheit_-_prof_sabine_wieland","title":"Software Qualität ist wie Schönheit ","subtitle":"10 Gebote für Flexibilität und Sicherheit","track":"Privacy and Security","type":"lecture","language":"de","abstract":"Wer kennt fehlerfreie Software? Wie wird Software Qualität gemessen?\r\nWas muss bei der Entwicklung von Software beachtet werden?\r\nWie gestalten wir unsere IT Zukunft? Diese Fragen werden in dem Vortrag diskutiert und natürlich Software mit Schönheit verglichen.","description":"Mit Industrie 4.0 wird die nächste Ebene der Digitalisierung unserer Gesellschaft erreicht. Jeder Lebensbereich ist von der Digitalisierung betroffen und damit auch abhängig von der Qualität der Software. \r\nIm Jahr 2014 wurden laut HPI weltweit fast 6500 Sicherheitsschwachstellen in Software gemeldet. Für OpenSSL, eine Open Source Software zur Bereitstel-lung von verschlüsselten Netzwerkdiensten, wurden über 200 Sicherheitslücken gemeldet. Das ist positiv, denn jede gemeldete Sicherheitslücke kann behoben werden, ein schneller Release Wechsel bei OpenSSL zeigt das. Software von Microsoft, Apple, Google, Mozilla, Oracle, HP, Adobe etc. reiht sich mit kritischen Sicherheitslücken in die Statistik ein. Nicht berücksichtigt bleiben alle Sicherheitslücken, die existieren, aber nicht gemeldet werden. \r\nWir erschaffen ein Monster! Ein weltumspannendes, das gesamte Leben und die Gesellschaft beherrschendes, von jedem manipulierbares Software Monster. Dieses Monster können wir auch nicht einfach abschalten, denn dann geht überall das Licht aus… Es gibt nur eine Lösung: Software unter Einhaltung der 10 Gebote des Software Engineering entwickeln und schrittweise alle andere Software ablösen. Hierzu sind SOA und Cloud Computing der richtige Weg, denn diese Technolo-gien funktionieren nur mit lose gekoppelten Services!","persons":[{"id":274,"full_public_name":"Prof. Sabine Wieland"}],"links":[]},{"id":396,"guid":"cec2e3a4-8c6d-48d0-adcd-240fdeb1d74f","logo":null,"date":"2016-04-28T11:00:00+02:00","start":"11:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_396_-_de_-_f0_01_-_201604281100_-_crypto-wissen_und_systemadministration_-_rene_lynx_pfeiffer","title":"Crypto-Wissen und Systemadministration","subtitle":"Was muß man als Systemadministratorin über kryptographische Werkzeuge wissen?","track":"System Administration","type":"lecture","language":"de","abstract":"Die zunehmende Verbreitung von verschlüsselten Protokollen ist toll. SSL/TLS in Form von HTTPS ist mittlerweile jedem bekannt. In der Systemadministration gibt es jedoch weit mehr als verschlüsselte Webseiten. Welche Werkzeuge und Protokolle muß man kennen und beherrschen, wenn es um moderne Systemadministration geht?","description":"Der Vortrag beleuchtet kryptographische Methoden in der Systemadministration. Das bedeutet es geht nicht nur um Ver- und Entschlüsselung, sondern auch um Integrität in Form von digitalen Unterschriften. Das Publikum soll einen Überblick mit Beispielen für Werkzeuge bekommen, die ein Systemadministrator unbedingt beherrschen und einsetzen muß.\r\n\r\nGrundlegende Kenntnisse in GNU/Linux und Systemadministration sind von Vorteil.","persons":[{"id":124,"full_public_name":"René 'Lynx' Pfeiffer"}],"links":[]},{"id":464,"guid":"445e6f28-5eb6-49ba-b463-9feb5c0c8791","logo":"/system/logos/464/medium/connected_guhIO-01.png?1460108378","date":"2016-04-28T12:00:00+02:00","start":"12:00","duration":"00:45","room":"F0.01","slug":"LWW16_-_464_-_de_-_f0_01_-_201604281200_-_guhio_-_die_vernetzung_wird_mit_dir_sein_-_simon_honegger","title":"guhIO - Die Vernetzung wird mit dir sein!","subtitle":"Über die Zukunft vernetzter Geräte und wie du mühelos ein IoT-Profi wirst.","track":"Open Everything","type":"lecture","language":"de","abstract":"<p>Das Vernetzen von 'eh allem' ist gerade angesagt. Wir wir mühelos unsere Gadgets zum Leben erwecken - ohne big data - erklärt Simon von guh.</p>\r\n\r\n<p>Anschließend unterhalten wir uns über deine Meinung zur Zukunft mit Social Media, vernetzten Autos usw.</p>","description":"<h3>Simon says: \"Hallo liebe Kollegen!</h3> \r\n<p>Das Thema meines kurzen Vortrags handelt von Vernetzung. Unser ständiger Begleiter, das Smartphone, hat uns bereits zu vernetzten Menschen gemacht. Freundschaft \"on demand\" sozusagen.\r\nNun bricht ein neuer Hype los: \"The Internet of Things\" ist in aller Munde. Konzerne und Startups reißen sich um dieses Thema.</p>\r\n<br>\r\n<p>Aber was bedeutet das eigentlich? Die Vernetzung von Maschinen wird in den nächsten Jahren einiges ändern.\r\nDas exponentiell wachsende Internet mit all seinen Teilnehmern wird uns produktiver, aber abhängiger machen. Wer kontrolliert das?</p>\r\n<br>\r\n<p>Eine kurze Aussicht bis 2024 mit den möglichen Auswirkungen, die do's and dont's von IoT, sowie Möglichkeiten, die Technologien sehr einfach privat und kommerziell zu nutzen (etwas Eigenwerbung ;) werden Gegenstand meines Vortrages sein.</p>\r\n<br>\r\n<p>Im Anschluss tauschen wir unsere Zukunftsvisionen aus - ich freue mich von euch zu lernen!\"</p>","persons":[{"id":338,"full_public_name":"Simon Hönegger"}],"links":[{"url":"www.guh.io","title":"guhIO for business: Make connected products within days."},{"url":"guh.github.io/guh","title":"guhIO on github: \"Take me home, ...\""}]},{"id":447,"guid":"73335314-0bf0-4657-ae67-b1fd6882d75c","logo":null,"date":"2016-04-28T12:45:00+02:00","start":"12:45","duration":"00:45","room":"F0.01","slug":"LWW16_-_447_-_en_-_f0_01_-_201604281245_-_privacy_und_security_mit_iot","title":"Privacy und Security mit IoT","subtitle":"","track":"Open Hardware","type":"lecture","language":"en","abstract":"","description":"","persons":[],"links":[]},{"id":340,"guid":"ddd078ae-f24f-43c1-8059-c585b0992080","logo":null,"date":"2016-04-28T13:30:00+02:00","start":"13:30","duration":"01:00","room":"F0.01","slug":"LWW16_-_340_-_de_-_f0_01_-_201604281330_-_qtalk_privacy_security_bei_iot","title":"qTalk Privacy & Security bei IoT","subtitle":"","track":"Privacy and Security","type":"podium","language":"de","abstract":"","description":"","persons":[],"links":[]},{"id":407,"guid":"48681e02-3c10-4667-8c67-54da1d31ebab","logo":null,"date":"2016-04-28T14:30:00+02:00","start":"14:30","duration":"00:30","room":"F0.01","slug":"LWW16_-_407_-__-_f0_01_-_201604281430_-_the_other_side_of_the_coin_user_experiences_with_bitcoin_security_and_privacy_-_katharina_krombholz","title":"The Other Side of the Coin: User Experiences with Bitcoin Security and Privacy","subtitle":"","track":"Privacy and Security","type":"lecture","language":"","abstract":"In this talk, I present the findings from a large-scale study on user experiences with Bitcoin security and privacy. The talk is based on a paper we recently published at the Conference on Financial Cryptography and Data Security 2016 .","description":"We present the first large-scale survey to investigate how users experience the Bitcoin ecosystem in terms of security, privacy and anonymity. We surveyed 990 Bitcoin users to determine Bitcoin management strategies and identified how users deploy security measures to protect their keys and bitcoins. We found that about 46% of our participants use web-hosted solutions to manage at least some of their bitcoins, and about half of them use exclusively such solutions. We also found that many users do not use all security capabilities of their selected Bitcoin management tool and have significant misconceptions on how to remain anonymous and protect their privacy in the Bitcoin network. Also, 22% of our participants have already lost money due to security breaches or self-induced errors. To get a deeper understanding, we conducted qualitative interviews to explain some of the observed phenomena. ","persons":[{"id":254,"full_public_name":"Katharina Krombholz"}],"links":[{"url":"http://fc16.ifca.ai/preproceedings/33_Krombholz.pdf","title":"Paper"}]},{"id":421,"guid":"80f6bf09-998d-4427-bbed-a4196b34b7ae","logo":null,"date":"2016-04-28T15:00:00+02:00","start":"15:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_421_-_de_-_f0_01_-_201604281500_-_end2end_ist_nicht_genug_smtp_tls_an_der_uni_wien_-_wolfgang_breyha","title":"End2End ist nicht genug! SMTP TLS an der Uni Wien","subtitle":"","track":"Privacy and Security","type":"lecture","language":"de","abstract":"Am Beispiel der Mail-Infrastruktur der Universität Wien soll gezeigt werden warum am lückenlose Einsatz von TLS kein Weg vorbeiführt. Mit konkreten Konfigurationsbeispielen für Exim und Cyrus-IMAPd wird eine mögliche Umsetzung der bettercrypto.org-Empfehlungen gezeigt. Abschließend wird auch die Sicht der Uni Wien auf das externe TLS-Umfeld gezeigt.","description":"","persons":[{"id":323,"full_public_name":"Wolfgang Breyha"}],"links":[]},{"id":417,"guid":"9216b290-3fd6-41ee-827f-f12d2b225750","logo":null,"date":"2016-04-28T16:00:00+02:00","start":"16:00","duration":"00:45","room":"F0.01","slug":"LWW16_-_417_-_de_-_f0_01_-_201604281600_-_einfuhrung_in_dnssec_-_otmar_lendl","title":"Einführung in DNSSEC","subtitle":"","track":"Privacy and Security","type":"lecture","language":"de","abstract":"Dieser Vortrag erklärt die Grundprinzipien von DNSSEC: Warum wurde es eingeführt, wie funktioniert das und was kann man damit erreichen.","description":"","persons":[{"id":321,"full_public_name":"Otmar Lendl"}],"links":[]},{"id":355,"guid":"cc262c4b-3e01-42c6-a229-f660bdb9e98a","logo":"/system/logos/355/medium/Eule.jpg?1454074621","date":"2016-04-28T17:00:00+02:00","start":"17:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_355_-_de_-_f0_01_-_201604281700_-_cloud_computing_fur_kmu_-_prof_sabine_wieland","title":"Cloud Computing für KMU","subtitle":"sichere IT mit Cloud Computing für Klein- und Mittelständige Unternehmen (KMU)","track":"Privacy and Security","type":"lecture","language":"de","abstract":"professionelle Cyber Kriminalität, Digitalisierung in jedem Bereich, Soziale Netze, globale Wirtschaft, staatliche Geheimdienste, Sorglosigkeit von Verantwortlichen und privaten Nutzern bilden das Umfeld, in dem KMU eine IT betreiben. Welche Anforderungen werden an eine sichere IT gestellt und wie können diese erfüllt werden.","description":"Im Spannungsfeld zwischen professioneller Cyber Kriminalität, Digitalisierung in jedem Bereich, Sozialen Netzen, globale Wirtschaft, Wirtschaftsspionage, staatlichen Geheimdiensten, Sorglosigkeit von Verantwortlichen und privaten Nutzern betreiben  KMU eine eigene IT. \r\nDer Vortrag geht auf folgende Fragen ein:\r\nWelche Anforderungen werden an eine sichere IT gestellt?\r\nWelche Voraussetzungen müssen für eine sichere IT geschaffen werden?\r\nWie kann ein KMU mit 10 bis 100 Mitarbeitern diese Voraussetzungen erfüllen?\r\nWelche Anforderungen werden an den Cloud Provider und die Cloud Dienste gestellt?","persons":[{"id":274,"full_public_name":"Prof. Sabine Wieland"}],"links":[]},{"id":345,"guid":"518606aa-ce60-4ff4-8fe4-c1ddb2d6e8a7","logo":null,"date":"2016-04-28T18:00:00+02:00","start":"18:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_345_-_de_-_f0_01_-_201604281800_-_gefahren_der_cloud_-_philipp_krenn","title":"Gefahren der Cloud","subtitle":"","track":"Cloud","type":"lecture","language":"de","abstract":"Eine große Stärke der Cloud ist, wie schnell man seine Infrastruktur hochskalieren kann. Das Problem daran ist allerdings, dass es in die umgekehrte Richtung genau so schnell gehen kann — wenn man nicht auf die Sicherheit geachtet hat.\r\nZum Einstieg diskutieren wir drei konkrete Vorfälle: Von alle Daten gelöscht, über unerwünschtes Bitcoin Mining bis zu alle Server-Instanzen terminiert.\r\nDanach besprechen wir einige einfache Schritte, wie man sich gegen derartige Fälle verteidigen kann; sowohl allgemein als auch mit einem speziellen Blick auf Amazon Web Services. Dabei geht es um allgemein gültige Handlungsweisen wie Principle of Least Privilege und spezielle Fähigkeiten der AWS Plattform.","description":"","persons":[{"id":209,"full_public_name":"Philipp Krenn"}],"links":[]}],"F0.02":[{"id":460,"guid":"a3add739-14a0-40e5-b73e-c4ae575e44c8","logo":null,"date":"2016-04-28T11:00:00+02:00","start":"11:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_460_-_de_-_f0_02_-_201604281100_-_combat_the_fud_-_franz_theisen","title":"Combat the FUD!","subtitle":"Fehlinformationen über OpenSource begegnen","track":"Open Everything","type":"lecture","language":"de","abstract":"Vorurteilen gegenüber dem professionelle OpenSource Einsatz strukturiert entgegen treten.","description":"\"Linux and open source have won, get over it\" - So titelt ZDnet am 04.01.2016. Dennoch sind Vorurteile über das Entwicklungsmodel OpenSource weit verbreitet und Fehlinformationen noch immer an der Tagesordnung.\r\n\r\nZiel des Vortrages ist es, eine strukturierte Übersicht gängiger Vorurteile gegenüber dem professionellen Einsatz von OpenSource Technologie zu liefern & diesen abseits ideologischer Grabenkämpfen bestimmt entgegen zu treten.","persons":[{"id":336,"full_public_name":"Franz Theisen"}],"links":[]},{"id":366,"guid":"2f5edd8a-7860-44d2-94bf-d0913816c729","logo":null,"date":"2016-04-28T12:00:00+02:00","start":"12:00","duration":"01:00","room":"F0.02","slug":"LWW16_-_366_-_de_-_f0_02_-_201604281200_-_it_service_management_mit_opensource_tools_-_christian_wally","title":"IT Service Management mit Opensource Tools","subtitle":"","track":"System Administration","type":"lecture","language":"de","abstract":"Im Vortrag soll gezeigt werden, wie durch das Zusammenspiel der Opensource Tools i-doit (IT Dokumentation), Icinga (Monitoring) und OTRS (Ticketing) die wichtigsten Prozesse von ITIL unterstützt und umgesetzt werden können.","description":"Die stetig wachsende Komplexität der IT, zunehmende Abhängigkeiten der Geschäftsprozesse von der IT und der Trend zur Arbeitsteilung, rücken die Prozess- und Kundenorientierung bei der Leistungserbringung durch die IT Abteilungen zunehmend in den Blickpunkt von Administratoren und Entscheidungsträgern.\r\n\r\nFür Großunternehmen hat sich die IT Infrastructure Library als Defakto Standard bei der Einführung von IT Servicemanagement etabliert. Da die ITIL modular aufgebaut ist, können auch KMU durch die Einführung einzelner Prozesse, die als \"Best Practices\" beschrieben sind, profitieren.","persons":[{"id":291,"full_public_name":"Christian Wally"}],"links":[]},{"id":395,"guid":"14ebf6cb-6f7a-4a25-ad43-e6f5931bba11","logo":null,"date":"2016-04-28T14:00:00+02:00","start":"14:00","duration":"01:00","room":"F0.02","slug":"LWW16_-_395_-_de_-_f0_02_-_201604281400_-_sichere_dienste_im_unternehmen_mit_tor_hidden_services_-_rene_lynx_pfeiffer","title":"Sichere Dienste im Unternehmen mit TOR Hidden Services","subtitle":"Daten und Metadaten richtig vor Bedrohungen schützen","track":"Privacy and Security","type":"lecture","language":"de","abstract":"Für Bedrohungen für Daten im Internet gibt es seit Bekanntwerden der Snowden Files eine größere Awareness. Viele Systemadministratoren haben daher Verschlüsselung konfiguriert, um Daten in Transit vor Neugierigen zu schützen. Da aber sowohl \"Cyber\" Crime als auch \"Cyber\" Defence zunehmend auf die Auswertung von Metadaten setzt, gilt es jetzt diese zu beschützen. Dieser Vortrag gibt eine kurze Einführung in die Hidden Services des Anonymisierungsnetzwerks TOR und wie man diese verwendet, um Daten für die eigene Unternehmung oder Kunden zu transportieren.","description":"Die Hidden Services des Anonymisierungsnetzwerks TOR bieten sehr viele Vorteile für den Transport und die Sicherung der Daten in Transit. Darüber hinaus schützt die Verwendung von TOR vor dem Lecken von Metadaten. Transport- oder E-Mail-Verschlüsselung hat sich mittlerweile verbreitet. Wer mit wem kommuniziert, sagt viel über Unternehmen und deren laufende Projekte aus. Man kann Hidden Services dazu nutzen, unternehmenseigene Ressourcen anzusprechen und so sowohl Daten als auch Metadaten vor Ausspähung bewahren.\r\n\r\nWie verwendet man TOR mit Hidden Services richtig?\r\nWas ist zu beachten?\r\nWelche Applikationen eignen sich für Hidden Services?\r\nWie bettet man Hidden Services in die IT Infrastruktur ein?","persons":[{"id":124,"full_public_name":"René 'Lynx' Pfeiffer"}],"links":[]},{"id":448,"guid":"67b3ddf4-f91c-4f01-a12b-39de308cd418","logo":null,"date":"2016-04-28T15:00:00+02:00","start":"15:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_448_-_de_-_f0_02_-_201604281500_-_bsb_reserviert","title":"BSB reserviert","subtitle":"","track":"System Administration","type":"lecture","language":"de","abstract":"","description":"","persons":[],"links":[]},{"id":365,"guid":"35038278-e615-40a3-9b38-cf477b4633cd","logo":"/system/logos/365/medium/TKmon-Logo.png?1456235748","date":"2016-04-28T16:00:00+02:00","start":"16:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_365_-_de_-_f0_02_-_201604281600_-_tkmon_monitoring_leicht_gemacht_-_thomas_niedermeier","title":"TKmon – Monitoring leicht gemacht","subtitle":"","track":"System Administration","type":"lecture","language":"de","abstract":"Dieser Vortrag gibt einen Einblick in die Open Source Aktivitäten von Thomas-Krenn und zeigt, wie Sie mithilfe unseres Icinga-Webfrontends TKmon Ihr Monitoring vereinfachen.","description":"Aus Mangel an Plugins zur Überwachung von Server-Hardware starteten wir von Thomas-Krenn im Jahr 2009 mit dem check_ipmi_sensor Plugin unsere erste Open Source Software. Heute können dieses und zahlreiche weitere Plugins rasch & kommandozeilenfrei zum Überwachen von kleinen & mittleren Netzwerken verwendet werden. Die Basis dazu liefert TKmon als übersichtliches und intuitives Open Source Webfrontend für Icinga. Im Vortrag geben wir einen Einblick in unsere Open-Source-Aktivitäten und zeigen, wie Sie mit TKmon Netzwerke überwachen und bei Problemen zeitnah per E-Mail & SMS informiert werden.","persons":[{"id":290,"full_public_name":"Thomas Niedermeier"}],"links":[{"url":"https://www.thomas-krenn.com/de/wiki/TKmon","title":"TKmon"},{"url":"https://www.thomas-krenn.com","title":"Thomas-Krenn"}]},{"id":383,"guid":"e14a55f5-e45d-47dd-ab40-8df4808d4a61","logo":null,"date":"2016-04-28T17:00:00+02:00","start":"17:00","duration":"01:00","room":"F0.02","slug":"LWW16_-_383_-_de_-_f0_02_-_201604281700_-_open_your_virtual_datacenter_-_rene_koch","title":"Open Your Virtual Datacenter","subtitle":"Open Source Virtualisierung mit oVirt als Alternative zu VMware","track":"System Administration","type":"lecture","language":"de","abstract":"Virtualisierung ist heutzutage die Grundlage vieler IT-Umgebungen in mittleren und großen Unternehmen und Organisationen. Eine hochperformante Open Source Lösung kombiniert mit Enterprise Management Features stellt die auf KVM basierende Red Hat Enterprise Virtualization und dessen Upstream Projekt oVirt dar.","description":"In diesem Vortrag wird die Virtualisierungslösung oVirt vorgestellt. Neben einer kurzen Beschreibung der einzelnen Komponenten und Tools wird auch auf typische Einsatzmöglichkeiten eingegangen. \r\n\r\nDer zweite Teil des Vortrags beschreibt wie man eine Virtualisierungsumgebung mit 2 oder mehreren Hypervisoren und Storage als Alternative zu VMware aufbaut. Des weiteren wird auch auf Migrationswege von einer bestehenden VMware-Umgebung zu oVirt eingegangen.","persons":[{"id":304,"full_public_name":"René koch"}],"links":[{"url":"http://www.ovirt.org","title":"oVirt Projekt"}]},{"id":416,"guid":"a1e0b5a3-a61a-4cf3-bfae-8406ec3d6082","logo":null,"date":"2016-04-28T18:00:00+02:00","start":"18:00","duration":"01:00","room":"F0.02","slug":"LWW16_-_416_-_de_-_f0_02_-_201604281800_-_backup_losung_fur_klein-_und_mittelunternehmen_-_reinhard_hawel","title":"Backup Lösung für Klein- und Mittelunternehmen","subtitle":"","track":"System Administration","type":"lecture","language":"de","abstract":"","description":"","persons":[{"id":221,"full_public_name":"Reinhard Hawel"}],"links":[]}],"F2.01":[{"id":353,"guid":"54bd3bd1-2b00-48ed-8997-6ea981dad92e","logo":null,"date":"2016-04-28T11:00:00+02:00","start":"11:00","duration":"00:45","room":"F2.01","slug":"LWW16_-_353_-_de_-_f2_01_-_201604281100_-_open_source_cms_im_vergleich_-_markus_angermann","title":"Open Source CMS im Vergleich","subtitle":"Typo3, Wordpress, Joomla, Drupal,.. welches CMS nehme ich heute?","track":"Open Everything","type":"lecture","language":"de","abstract":"Open Source Web Content Management Systeme im Vergleich, Vortrag (oder auch Workshop) zu den bestehenden Systemen.","description":"Web Entwicklern stehen heutzutage viele Content Management Systeme im Open Source Bereich zu Verfügung. Ein Vergleich von PHP/MySQL basierten Systemen soll die Vor- und Nachteile der gängigsten CMS beleuchten und diskutieren.","persons":[{"id":272,"full_public_name":"Markus Angermann"}],"links":[]},{"id":376,"guid":"8f972897-bb1a-4add-b401-96b72894113c","logo":null,"date":"2016-04-28T12:00:00+02:00","start":"12:00","duration":"00:45","room":"F2.01","slug":"LWW16_-_376_-_de_-_f2_01_-_201604281200_-_varnish_-_johannes_truschnigg","title":"Varnish","subtitle":"Eine Einführung in den \"high performance web accelerator\"","track":"System Administration","type":"lecture","language":"de","abstract":"Varnish ist ein moderner HTTP/1.1 Reverse Proxy, der fast jede Website mit nur wenig Aufwand spürbar schneller machen kann. Dieser Vortrag richtet sich vornehmlich an Admins, die Varnish bislang eher vom Hörensagen kennen. Er beleuchtet die grundlegenden Konzepte und Ideen, die Varnish technisch hervorragend implementiert. Weiters bietet er einen kurzen, praktischen Einblick in die Inbetriebnahme und die Handhabung einer Varnish-Instanz.","description":"","persons":[{"id":297,"full_public_name":"Johannes Truschnigg"}],"links":[{"url":"file:///home/colo/Documents/pres/remark/linuxwochen-2016_varnish.html#1","title":"Slides (work in progress)"}]},{"id":387,"guid":"75b6e3cd-5ab9-4a0c-82dc-78b09f5aca95","logo":null,"date":"2016-04-28T13:00:00+02:00","start":"13:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_387_-_de_-_f2_01_-_201604281300_-_unternehmens_pki_mit_ejbca_-_mtausig","title":"Unternehmens PKI mit EJBCA","subtitle":"","track":"Privacy and Security","type":"lecture","language":"de","abstract":"In vielen Unternehmen und Organisationen macht es Sinn eine eigene PKI Infrastruktur zu betreiben, z.B. für den Betrieb interner Server oder um die Mitarbeiter mit persönlichen Zertifikaten auszustatten.\r\nMit EJBCA gibt es eine Java basierte Open Source Lösung die auch hochprofessionellen Anforderungen gerecht wird. \r\nIn unserem Vortrag möchten wir über einen grundsätzlichen PKI Aufbau und über die konkrete Umsetzung mit EJBCA erzählen.","description":"","persons":[{"id":306,"full_public_name":"mtausig"}],"links":[]},{"id":441,"guid":"d48839b2-7dd1-4a37-8557-31cc2a13335b","logo":"/system/logos/441/medium/Pinguin-Systeme.at_2014_195x73.png?1459427886","date":"2016-04-28T14:00:00+02:00","start":"14:00","duration":"00:45","room":"F2.01","slug":"LWW16_-_441_-_de_-_f2_01_-_201604281400_-_heterogene_landschaften_ad_ohne_windows_server_-_wolfgang_leithner","title":"Heterogene Landschaften: AD ohne Windows Server","subtitle":"Wie man ohne Microsoft Server glücklich wird","track":"System Administration","type":"lecture","language":"de","abstract":"Single-Sign-On und das Microsoft Domain Konzept haben sich in der letzten Dekade, trotz aller Probleme und Fehler, großflächig durchgesetzt. Doch zur Umsetzung benötigt man nicht notwendigerweise einen Windows Server.  ","description":"Wir zeigen anhand eines konkreten Beispiels die Migration von WinSRV und Exchange zu SUSE SLES und ZARAFA.\r\n\r\nAusgehend vom Stand zu Projektstart über die diversen Anforderungen bis hin zur Implementierung und den Nacharbeiten.","persons":[{"id":305,"full_public_name":"Wolfgang Leithner"}],"links":[]},{"id":364,"guid":"70aaf611-edd7-42f4-840f-fc24f18d9da6","logo":"/system/logos/364/medium/Proxmox-Logo-600.png?1456225092","date":"2016-04-28T15:00:00+02:00","start":"15:00","duration":"00:45","room":"F2.01","slug":"LWW16_-_364_-_en_-_f2_01_-_201604281500_-_zfs_and_corosync_cluster_-_advanced_features_of_proxmox_ve_-_emmanuel_kasper","title":"ZFS and Corosync Cluster - Advanced Features of Proxmox VE","subtitle":"How to use ZFS for optimal storage flexibility and a Corosync Cluster Engine for virtual machine group management.","track":"System Administration","type":"lecture","language":"en","abstract":"Abstract:\r\nThis talk will present how the ZFS file system and the Corosync cluster engine are integrated into the  Promox VE environnment, the open source server virtualization platform developed in Vienna.\r\n Prior knowledge of Proxmox VE is welcome, but not mandatory as the talk will also include a general overview of each technology outside the virtualization context.\r\n","description":"","persons":[{"id":287,"full_public_name":"Emmanuel Kasper"}],"links":[{"url":"http://pve.proxmox.com/wiki","title":"Proxmox VE"},{"url":"http://www.proxmox.com","title":"Proxmox Company"}]},{"id":391,"guid":"0ab670bf-a0a2-46a1-b33e-f6b7cc5a7603","logo":null,"date":"2016-04-28T16:00:00+02:00","start":"16:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_391_-_de_-_f2_01_-_201604281600_-_cluster_nach_dem_kiss-prinzip_-_christian_mock","title":"Cluster nach dem KISS-Prinzip","subtitle":"Ein Wochenende, 300 Zeilen Perl, kissclusterd ist geboren.","track":"System Administration","type":"lecture","language":"de","abstract":"Zwei Server, eine Menge virtuelle Maschinen drauf, und das ganze geclustert, bitte. Da muß es ja was geben. Ja, aber das ist alles viel zu komplex. Also schreiben wir schnell selber was...","description":"Hier geht es um simple 2-Node-Cluster zum Virtualisieren. Mit DRBD kann man das Storage-Problem sauber lösen, aber auf der Clustering-Seite gibt's nur Lösungen, die die falschen Probleme oder alle Probleme der Welt lösen wollen.\r\n\r\nWas mir an den getesteten Ansätzen (Corosync/Pacemaker, ganeti) nicht gefallen hat, woran das liegt, und wie ich das Problem dann für den einfachen Fall einfach gelöst habe, an einem Wochenende und mit 321 Zeilen Perl und ein paar systemd-Unitfiles, ist der Inhalt dieses Vortrags.\r\n\r\nMit Live-Demo: geclusterte Raspberry Pis mit Blinkenlights!","persons":[{"id":310,"full_public_name":"christian mock"}],"links":[{"url":"https://www.tahina.priv.at/kisscluster.html","title":"KISScluster Homepage"}]},{"id":454,"guid":"4e765769-9485-4eb8-9902-244deb2b396b","logo":null,"date":"2016-04-28T17:00:00+02:00","start":"17:00","duration":"00:45","room":"F2.01","slug":"LWW16_-_454_-__-_f2_01_-_201604281700_-_tomcat_von_klein_bis_ganz_gross","title":"Tomcat von klein bis ganz groß","subtitle":"","track":null,"type":"lecture","language":"","abstract":"","description":"","persons":[],"links":[]},{"id":349,"guid":"74dff9e9-654a-45e9-8335-475d9fab0c79","logo":"/system/logos/349/medium/selinux-penguin-125.png?1452453102","date":"2016-04-28T18:00:00+02:00","start":"18:00","duration":"00:45","room":"F2.01","slug":"LWW16_-_349_-_de_-_f2_01_-_201604281800_-_selinux_in_30_minuten_durchschauen_und_unsere_linux-skills_verbessern_-_mario_rosic","title":"SELinux in 30 Minuten durchschauen und unsere Linux-Skills verbessern","subtitle":"Über das DAC-Problem, den Kernel und verheerende Bugs","track":"System Administration","type":"lecture","language":"de","abstract":"Hier erf&auml;hrt man, wie SELinux funktioniert und bekommt die komplexen Hintergr&uuml;nde einfach erkl&auml;rt: F&uuml;r alle, die an Linux im Allgemeinen oder an SELinux im Speziellen interessiert sind. ","description":"SELinux ist f&uuml;r viele Admins ein Mysterium, oft wird nach der Installation von CentOS/RHEL als erstes SELinux deaktiviert und der Server damit verwundbarer gemacht. Einer der Gr&uuml;nde daf&uuml;r ist der Mangel an guten Lernmaterialien. Ich werde hier den Vortrag halten, den ich gleich zu Anfang meiner Besch&auml;ftigung mit SELinux gebraucht h&auml;tte, aber nirgends bekommen habe.<br />\r\n<br />\r\nHier geht es explizit nicht darum, SELinux-Probleme zu troubleshooten, sondern darum, die Hintergr&uuml;nde zu verstehen und unser Wissen &uuml;ber Linux zu erweitern: <br />\r\nWarum hat man SELinux erfunden und was ist das DAC-Problem?<br />\r\nWie funktioniert SELinux - was sind Extended Attributes, was ist MAC und welche Rolle spielt das Linux Audit Framework in dem Ganzen?<br />\r\nUnd was f&uuml;r coole Sachen kann man damit machen?<br />\r\n<br />\r\nDer Vortrag ist f&uuml;r alle interessierten Linux-Nutzer geeignet, wobei Sysadmins, die SELinux lernen wollen/m&uuml;ssen, den gr&ouml;&szlig;ten Nutzen aus ihm ziehen werden.","persons":[{"id":270,"full_public_name":"Mario Rosic"}],"links":[{"url":"http://www.internex.at/","title":"Ich mache schamlose Schleichwerbung für meinen Arbeitgeber"}]}],"EDV F1.01":[],"EDV F1.02":[],"Sem F4.01":[{"id":381,"guid":"172e1110-49b9-4e78-b843-dd0e4ee47ed6","logo":null,"date":"2016-04-28T11:00:00+02:00","start":"11:00","duration":"04:00","room":"Sem F4.01","slug":"LWW16_-_381_-__-_sem_f4_01_-_201604281100_-_wege_zur_guten_it-dokumentation_-_christian_wally","title":"Wege zur guten IT-Dokumentation","subtitle":"Die Dokumentation, das ungeliebte Kind","track":"System Administration","type":"workshop","language":"","abstract":"Das Wissen über die technische und logische Betriebsstruktur ihrer IT erhalten viele Organisationen nur von Inseldokumentationen einzelner Mitarbeiter oder externer Dienstleistern. ","description":"Ziel des Workshop \"Wege zur guten IT-Dokumentation\" ist es durch strukturierte IT-Dokumentation Informationen nutzbar zu machen. Unternehmen, die erfolgreich eine gemeinsame IT-Dokumentation betreiben, sparen innerhalb ihrer Geschäftseinheit bis zu 20% Arbeitszeit durch solch \"nutzbare Informationen\" ein.\r\n\r\nIm Workshop \"Wege zur guten IT-Dokumentation\" geben wir Impulse und Handlungsempfehlungen für eine effiziente IT-Dokumentation.","persons":[{"id":291,"full_public_name":"Christian Wally"}],"links":[]},{"id":377,"guid":"3d048d74-8a53-4884-8277-ccebd3193e04","logo":"/system/logos/377/medium/2016-02-29_22_47_41-DANE.png_(875%C3%97713).png?1456782531","date":"2016-04-28T15:00:00+02:00","start":"15:00","duration":"01:00","room":"Sem F4.01","slug":"LWW16_-_377_-_de_-_sem_f4_01_-_201604281500_-_sicherer_e-mail-dienste-anbieter_1_2_-_gunnar_haslinger","title":"Sicherer E-Mail-Dienste-Anbieter 1/2","subtitle":"DNSSec & DANE","track":"Privacy and Security","type":"lecture","language":"de","abstract":"Sicherer E-Mail-Dienste-Anbieter basierend auf Domain Name System Security Extension (DNSSec) & DNS-based Authentication of Named Entities (DANE)","description":"Dieser Vortrag zum gleichnamigen verfügbaren Paper beschäftigt sich mit der praktischen Implementierung eines sicheren E -Mail-Dienste-Anbieters (gemäß Vorgabe BSI), basierend auf DANE (DNS-based Authentication of Named Entities) und DNSSec (Domain Name System Security Extension). \r\n\r\nDie Umsetzung erfolgt mittels Debian 8 Jessie unter Verwendung des DNS-Servers BIND, des Mailservers Postfix, des WebServers Apache mit WebMailer RoundCube. Die IMAP und POP3 Dienste werden mittels Dovecot realisiert. \r\n\r\nKryptographische Grundlagen werden hierbei vorausgesetzt, spezifische Funktionalitäten von DANE und DNSSec zuvor erläutert und anschließend deren Konfiguration demonstriert sowie die Demo-Implementierung nachvollziehbar getestet. \r\n\r\nDabei wurde auf sichere Konfiguration der verwendeten TLS-Protokolle und CipherSuites sowie auf zeitgemäße Verwendung und Konfiguration von DNSSec, DANE, Certificate-Pinning, Public-Key-Pinning, HTTP-Strict-Transport-Security u.v.m. geachtet.","persons":[{"id":299,"full_public_name":"Gunnar Haslinger"}],"links":[]},{"id":453,"guid":"46b5b613-89f7-4837-8b99-dd51a92fe435","logo":"/system/logos/453/medium/2016-02-29_22_47_41-DANE.png_(875%C3%97713).png?1459794887","date":"2016-04-28T16:00:00+02:00","start":"16:00","duration":"01:00","room":"Sem F4.01","slug":"LWW16_-_453_-_de_-_sem_f4_01_-_201604281600_-_sicherer_e-mail-dienste-anbieter_2_2_-_gunnar_haslinger","title":"Sicherer E-Mail-Dienste-Anbieter 2/2","subtitle":"DNSSec & DANE","track":"Privacy and Security","type":"lecture","language":"de","abstract":"Sicherer E-Mail-Dienste-Anbieter basierend auf Domain Name System Security Extension (DNSSec) & DNS-based Authentication of Named Entities (DANE)","description":"Dieser Vortrag zum gleichnamigen verfügbaren Paper beschäftigt sich mit der praktischen Implementierung eines sicheren E -Mail-Dienste-Anbieters (gemäß Vorgabe BSI), basierend auf DANE (DNS-based Authentication of Named Entities) und DNSSec (Domain Name System Security Extension).\r\n\r\nDie Umsetzung erfolgt mittels Debian 8 Jessie unter Verwendung des DNS-Servers BIND, des Mailservers Postfix, des WebServers Apache mit WebMailer RoundCube. Die IMAP und POP3 Dienste werden mittels Dovecot realisiert.\r\n\r\nKryptographische Grundlagen werden hierbei vorausgesetzt, spezifische Funktionalitäten von DANE und DNSSec zuvor erläutert und anschließend deren Konfiguration demonstriert sowie die Demo-Implementierung nachvollziehbar getestet.\r\n\r\nDabei wurde auf sichere Konfiguration der verwendeten TLS-Protokolle und CipherSuites sowie auf zeitgemäße Verwendung und Konfiguration von DNSSec, DANE, Certificate-Pinning, Public-Key-Pinning, HTTP-Strict-Transport-Security u.v.m. geachtet.","persons":[{"id":299,"full_public_name":"Gunnar Haslinger"}],"links":[]}],"Sem F4.02":[{"id":456,"guid":"098bf163-b0ac-4eea-9210-d42558310e53","logo":null,"date":"2016-04-28T10:00:00+02:00","start":"10:00","duration":"03:00","room":"Sem F4.02","slug":"LWW16_-_456_-__-_sem_f4_02_-_201604281000_-_deb_donnerstag_vormittag_-_christian_amsuess","title":"[deb] Donnerstag Vormittag","subtitle":"","track":null,"type":"meeting","language":"","abstract":"","description":"","persons":[{"id":279,"full_public_name":"Christian Amsuess"}],"links":[]},{"id":457,"guid":"44523f70-e4c1-4f7d-800c-35f240f6661e","logo":null,"date":"2016-04-28T14:00:00+02:00","start":"14:00","duration":"03:00","room":"Sem F4.02","slug":"LWW16_-_457_-__-_sem_f4_02_-_201604281400_-_deb_donnerstag_nachmittag_-_christian_amsuess","title":"[deb] Donnerstag Nachmittag","subtitle":"","track":null,"type":"meeting","language":"","abstract":"","description":"","persons":[{"id":279,"full_public_name":"Christian Amsuess"}],"links":[]}],"Sem F4.07":[]}},{"index":1,"date":"2016-04-29","day_start":"2016-04-29T10:00:00+02:00","day_end":"2016-04-29T19:00:00+02:00","rooms":{"F0.01":[{"id":408,"guid":"cb3c61bb-f26a-43ab-aa9b-ec9ef549f65f","logo":null,"date":"2016-04-29T10:00:00+02:00","start":"10:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_408_-_de_-_f0_01_-_201604291000_-_citizen_data_science_-_balazs_barany","title":"Citizen Data Science","subtitle":"Datenanalyse für Sterbliche","track":"Open Data","type":"lecture","language":"de","abstract":"Ein aktueller Modebegriff ist der des \"Citizen Data Scientist\". Er bezeichnet Leute, die nicht hauptberuflich Analytik betreiben, aber die Werkzeuge und Methoden von Data Scientists übernehmen, um ihre Ziele zu erreichen.","description":"Der Vortrag demonstriert Methoden und Werkzeuge für Normalsterbliche, die mehr mit Daten machen wollen - ob es sich um Daten ihres Unternehmens, ihre eigenen oder um Open Data handelt. Open-Source- und frei verfügbare Werkzeuge für Datenanalyse und predictive analytics werden vorgestellt. ","persons":[{"id":14,"full_public_name":"Balázs Bárány"}],"links":[]},{"id":360,"guid":"50285f15-f834-4c74-b948-f224a8557c45","logo":null,"date":"2016-04-29T11:00:00+02:00","start":"11:00","duration":"00:45","room":"F0.01","slug":"LWW16_-_360_-_de_-_f0_01_-_201604291100_-_open_innovation_open_data_-_ing_brigitte_lutz_msc","title":"Open Innovation # Open Data","subtitle":"Daten sind der Rohstoff des 21. Jahrhunderts","track":"Open Data","type":"lecture","language":"de","abstract":"Daten sind der Rohstoff des 21. Jahrhunderts und Basis für Innovationen, die im Zeitalter der Digitalisierung entstehen. Offene Datenschätze der Verwaltung und anderer Organisationen stehen frei zur Nutzung zur Verfügung.","description":"Es wird ein Überblick über Open Data in Österreich und darüber hinaus geboten. Open Data soll nicht nur die Transparenz erhöhen, sondern steht für Wirtschaft, Forschung und die interessierte Öffentlichkeit zur Nutzung bereit. Innovative und kreative Anwendungen entstehen und geben ihrerseits wieder offene Daten frei... ","persons":[{"id":283,"full_public_name":"Ing. Brigitte Lutz, MSc"}],"links":[]},{"id":451,"guid":"d770d7c7-011b-4368-bcbe-8726e2ab0975","logo":null,"date":"2016-04-29T12:00:00+02:00","start":"12:00","duration":"00:45","room":"F0.01","slug":"LWW16_-_451_-_de_-_f0_01_-_201604291200_-_faire_maus","title":"Faire Maus","subtitle":"maus, maus, komm heraus","track":null,"type":"lecture","language":"de","abstract":"","description":"","persons":[],"links":[]},{"id":442,"guid":"410042fb-ce72-4ba7-9412-34cf76e7e9d4","logo":null,"date":"2016-04-29T13:00:00+02:00","start":"13:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_442_-_en_-_f0_01_-_201604291300_-_fairphone_and_open_source_-_kees_jongenburger","title":"Fairphone and Open Source","subtitle":"","track":"Open Everything","type":"lecture","language":"en","abstract":"The story of Fairphone, the ethical smartphone that is built to last continues. With the Fairphone 2, the first modular smartphone on the market we address the Longevity aspects of the phone: users can easily replace broken parts by themselves and keep their phone longer. It goes without saying that Ownership and Longevity also need to be addressed in software. This is what this presentation is about.","description":"\r\n","persons":[{"id":330,"full_public_name":"Kees Jongenburger"}],"links":[{"url":"http://www.fairphone.com/","title":"Fairphone website"},{"url":"http://code.fairphone.com/","title":"Fairphone code website"}]},{"id":342,"guid":"0eb502a2-7764-4e4f-bc0b-75078dd64ff2","logo":null,"date":"2016-04-29T14:00:00+02:00","start":"14:00","duration":"00:45","room":"F0.01","slug":"LWW16_-_342_-_de_-_f0_01_-_201604291400_-_qtalk_faire_it","title":"qTalk Faire IT","subtitle":"","track":"Open Hardware","type":"podium","language":"de","abstract":"","description":"","persons":[],"links":[]},{"id":343,"guid":"88351402-cd93-46e8-890c-a19a7c6e1ae4","logo":null,"date":"2016-04-29T15:00:00+02:00","start":"15:00","duration":"00:45","room":"F0.01","slug":"LWW16_-_343_-_de_-_f0_01_-_201604291500_-_postgresql_die_performance_schnelldiagnose_-_postgresql_007","title":"PostgreSQL: Die Performance Schnelldiagnose","subtitle":"","track":"(Software) Development","type":"lecture","language":"de","abstract":"Wenn es in der Database klemmt, gilt es herauszufinden, woran es liegen könnte. Doch wie geht man ein Problem idealerweise an?\r\n\r\nDieser Vortrag gibt eine Anleitung zu einer erstaunlich effektiven Schnelldignose.","description":"Dieser Vortrag soll einen Leitfaden für die schnelle Diagnose von Problemen liiefern. Dabei werden die häufigsten Probleme besprochen und entsprechende Lösungsansätze aufgezeigt.","persons":[{"id":32,"full_public_name":"postgresql_007"}],"links":[]},{"id":368,"guid":"1d8f324a-ce29-4b11-8a4a-3161edd3daef","logo":"/system/logos/368/medium/SetWidth360-ansible-logo-black-square.png?1460057400","date":"2016-04-29T16:00:00+02:00","start":"16:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_368_-_de_-_f0_01_-_201604291600_-_ansible_-_stefan_g_weichinger","title":"ansible","subtitle":"Konfigurations-Management, Automatisierung, Orchestration","track":"System Administration","type":"lecture","language":"de","abstract":"Möglichkeiten, Konzepte, Vorteile, Beschreibung des Projekts\r\nmit live-demo von einfachen Playbooks ...\r\n","description":"","persons":[{"id":286,"full_public_name":"Stefan G. Weichinger"}],"links":[]},{"id":378,"guid":"2b7d821c-185e-4cc3-ab29-db3ba67d0426","logo":null,"date":"2016-04-29T17:00:00+02:00","start":"17:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_378_-_de_-_f0_01_-_201604291700_-_dos_dont_s_bei_der_einfuhrung_von_ansible_co_-_smilingbear","title":"Dos & Dont's bei der Einführung von Ansible & Co","subtitle":"","track":"System Administration","type":"lecture","language":"de","abstract":"Überall wimmelt's von Erfolgsgeschichten wie schnell und einfach\r\nAnsible, Chef, Puppet, SaltStack und andere Konfigurationsmanagement\r\nTools das Leben eines SysAdmins erleichtern.\r\n\r\nWenn man aber dann selbst versucht solche Tools auf 5+ Rechnern\r\nauszurollen, stolpert man über eine Hürde nach der nächsten.\r\nUnd Ruck-Zuck hat man eine Lösung, die sich entweder keiner mehr zu\r\nerweitern traut, weil sie zu komplex geworden ist, oder eine Lösung,\r\ndie unbenutzt in der Ecke verstaubt, weil sie nicht richtig\r\nfunktioniert.\r\n\r\nIn diesem Vortrag werden wir auf die wesentlichen Hürden bei der\r\nEinführung von Konfigurationsmanagement Tools eingehen und zeigen, was\r\nbeim Umschiffen dieser Hürden geholfen hat und was nicht.\r\n\r\nDabei werden wir uns vor allem auf die generellen Hürden\r\nkonzentrieren, die alle Konfigurationsmanagement Tools betreffen und\r\nuns nicht auf ein Tool versteifen.\r\n","description":"","persons":[{"id":223,"full_public_name":"SmilingBear"}],"links":[]},{"id":401,"guid":"3100b813-4e9c-4587-a677-af3bdf3ec6bc","logo":null,"date":"2016-04-29T18:00:00+02:00","start":"18:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_401_-_de_-_f0_01_-_201604291800_-_automatisierung_in_devops_-_henning_von_kielpinski","title":"Automatisierung in DevOps","subtitle":"Diese Tools haben Methode","track":"(Software) Development","type":"lecture","language":"de","abstract":"DevOps als Methodologie ist auf dem Vormarsch um flexibel und agil auf die Herausforderungen einer sich schnell wandelnden IT Landschaft reagieren zu können. Der Einsatz von Automatisierung ist dabei ein wesentlicher Bestandteil um DevOps effizient einsetzen zu können. Dieser Vortrag beschreibt den Einsatz von Automatisierungstools in einem prototypischen DevOps Umfeld bei einem Automobilhersteller und wie sich diese Tools nahtlos in eine Strategie einfügen. Dargestellt wird dabei auch wie, quasi nebenbei, wichtige Messpunkte für die kontinuierliche Verbesserung der Abläufe installiert werden.\r\n\r\nDevOps wird häufig mit dem von John Willis und Damon Edwards eingeführten Akronym CAMS in verbindung gebracht, welches für Culture, Automation, Measurement und Sharing steht (später kam durch Jez Humble noch ein L für Lean hinzu, daraus entstand dann CALMS). Dabei ist bemerkenswert, dass Automatisierung und Messbarkeit zumindest 50% des Akronyms ausmachen. Die Möglichkeit bestimmte Abläufe innerhalb des Software Deployments eindeutig wiederholbar zu machen und dessen Ergebnisse zu protokollieren ist ein Schlüsselbestandteil von DevOps um auch die Verbesserungen wiederholbar zu machen. Die Tools dafür sind zum Teil schon lange am Markt aber legen erst im Kontext mit DevOps ihre Stärken wirklich dar. Mit einigen Praxisbeispielen der Tools wird in diesem Vortrag das Zusammenspiel von verschiedenen Open Source Komponenten von der GUI über Automatisierungs-Tools und End-to-End Testing bis hin zu PaaS Framework beschrieben und der Mehrwert für eine DevOps Methodik dargestellt.\r\n","description":"","persons":[{"id":314,"full_public_name":"Henning von Kielpinski"}],"links":[{"url":"https://www.consol.de/it-services/it-consulting/open-source-monitoring/sakuli/","title":"Sakuli: Ein Tool für End-to-End-Monitoring und für automatisierte GUI-Tests"},{"url":"https://www.consol.de/it-services/individualsoftware/citrus/","title":"Automatisiertes Test-Framework Citrus"}]}],"F0.02":[{"id":344,"guid":"53cadabd-9e40-4f29-8342-c93e5db9f4e4","logo":"/system/logos/344/medium/slide_0.jpg?1449541937","date":"2016-04-29T10:00:00+02:00","start":"10:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_344_-_de_-_f0_02_-_201604291000_-_loggen_mit_dem_elastic_stack_-_philipp_krenn","title":"Loggen mit dem Elastic Stack","subtitle":"","track":"System Administration","type":"lecture","language":"de","abstract":"Sind Sie bereit Ihre Deployment Sünden zu gestehen oder sind Sie noch in der Phase der Leugnung — im Wissen etwas falsch zu machen aber es nicht genau benennen zu können?\r\nIn dieser Präsentation besprechen wir die allgegenwärtigen Deployment Sünden und wie man ihnen begegnen kann.","description":"Das aktuell wahrscheinlich verbreitetste und beliebteste Werkzeug für Log-Monitoring und -Analyse ist der Elastic Stack:\r\n\r\n* Elasticsearch um große Datenmengen zu analysieren und zu durchsuchen.\r\n* Logstash und Beats alle relevanten Informationen einzusammeln.\r\n* Kibana zur leistungsstarken und flexiblen Visualisierung.\r\n\r\nDieser Vortrag gibt einen Überblick über die vier Technologien, wie sie zusammenarbeiten und wie sie Ihre Probleme lösen können.","persons":[{"id":209,"full_public_name":"Philipp Krenn"}],"links":[]},{"id":367,"guid":"ee4ac23c-f966-4436-99e7-abf44d01b090","logo":null,"date":"2016-04-29T10:45:00+02:00","start":"10:45","duration":"01:00","room":"F0.02","slug":"LWW16_-_367_-_de_-_f0_02_-_201604291045_-_systemd_-_stefan_g_weichinger","title":"systemd","subtitle":"(nicht nur) ein Init-System für Linux","track":"System Administration","type":"lecture","language":"de","abstract":"Einführung, Übersicht, warum wurden welche alten Zöpfe abgeschnitten, was sind die Zielsetzungen und Ansätze des Projekts?\r\n\r\nAnsprechen der großen Diskussionen rund um systemd, Erklärung zu ein paar der größten \"Mythen\" oder Gerüchte rundherum.\r\n\r\noptional live-demos","description":"Habe bereits dazu einen Vortrag auf den Linuxdays in Dornbirn gehalten ... kam sehr gut an :-)\r\n\r\nhttps://t.co/zkRJUHKQKV\r\n","persons":[{"id":286,"full_public_name":"Stefan G. Weichinger"}],"links":[]},{"id":422,"guid":"5708a511-57c0-4b1c-a433-283d972e8220","logo":null,"date":"2016-04-29T12:00:00+02:00","start":"12:00","duration":"01:00","room":"F0.02","slug":"LWW16_-_422_-_de_-_f0_02_-_201604291200_-_spf_dkim_dmarc_am_beispiel_uni_wien_-_wolfgang_breyha","title":"SPF/DKIM/DMARC am Beispiel Uni Wien","subtitle":"","track":"System Administration","type":"lecture","language":"de","abstract":"Nach einer kurzen Vorstellung aller relevanten RFCs zu SPF, DKIM und DMARC werden anhand der Infrastruktur der Uni Wien Vorteile, Probleme, Sinn und Unsinn der vorgestellten Techniken gezeigt. Dabei wird die konkrete Umsetzung mit Exim als MTA vorgestellt und auch einige Auswertungen wie sich die Techniken in der Praxis schlagen präsentiert.","description":"","persons":[{"id":323,"full_public_name":"Wolfgang Breyha"}],"links":[]},{"id":446,"guid":"6c7d2d1d-2762-43f8-8dfb-a2856f223afc","logo":null,"date":"2016-04-29T13:00:00+02:00","start":"13:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_446_-_de_-_f0_02_-_201604291300_-_tails_-_privatsphare_fur_alle","title":"Tails - Privatsphäre für alle","subtitle":"die Plattform auf die auch Snowden setzt","track":"Privacy and Security","type":"lecture","language":"de","abstract":"","description":"","persons":[],"links":[]},{"id":413,"guid":"befe36aa-2e66-437c-91bb-66695084140d","logo":null,"date":"2016-04-29T14:00:00+02:00","start":"14:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_413_-_en_-_f0_02_-_201604291400_-_openshift_persistent_storage_backends_-_elvir_kuric","title":"Openshift persistent storage backends ","subtitle":"","track":"Cloud","type":"lecture","language":"en","abstract":"In this presentation it will be presented how to configure Openshift to use different storage backends ( Gluster, Ceph, AWS EBS ) for persistent storage for Openshift pods  ","description":"","persons":[{"id":195,"full_public_name":"Elvir Kuric"}],"links":[]},{"id":403,"guid":"e042a8db-92d4-46d8-a2cb-e448477fc309","logo":null,"date":"2016-04-29T15:00:00+02:00","start":"15:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_403_-_en_-_f0_02_-_201604291500_-_groovy_scripting_-_siegfried_goeschl","title":"Groovy Scripting","subtitle":"","track":"(Software) Development","type":"lecture","language":"en","abstract":"Some tasks at hand are too complex for shell scripting and not large enough for a full-blown project. Siegfried Göschl used various scripting languages (Perl, Tcl, JavaScript, Ruby) over the years and finally settled for Groovy. Let's join him on his journey through Groovy Goodness and show off some cool features such as networking, JSON processing, library management, command line parsing and configuration files.","description":"Gave this presentation at the Java Meetup - see http://www.meetup.com/Java-Vienna/events/229020934/","persons":[{"id":231,"full_public_name":"Siegfried Goeschl"}],"links":[]},{"id":359,"guid":"906d18c1-c866-4c53-9349-ce1871a38bfe","logo":"/system/logos/359/medium/dmtf-redfish-logo.png?1455531154","date":"2016-04-29T16:00:00+02:00","start":"16:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_359_-_en_-_f0_02_-_201604291600_-_hello_redfish_goodbye_ipmi_-_werner_fischer","title":"Hello Redfish, Goodbye IPMI","subtitle":"The Future of System Management in the Data Center","track":"System Administration","type":"lecture","language":"en","abstract":"IPMI has been the de-facto standard for the remote management of server hardware since 1998. Nearly 20 years later, the new DMTF standard Refish brings hardware system managment into present age by using a RESTful interface over HTTPS and by supplying all data in the JSON format. Good news for all devops using Puppet, Ansible, Chef or Salt.","description":"It's the year 2016. The PC market keeps on shrinking. More and more people use mobile devices and store most of their data in the cloud. This is good news for server manufacturers and data center admins, as market researcher expect a growth of 3% for investments in data center systems.\r\nTo keep up with managing of all these cloud systems, IT professionals around the globe formed the devops movement and made the software part of server automation easier than ever before by using tools like Puppet, Ansible, Chef or Salt.\r\nThe software part... What about the hardware part? Hmm..., IPMI (the so-called Intelligent Platform Management Interface) has been the standard to manage systems out-of-band in the datacenter since 1998. It uses UDP port 623, has a specification document with over 600 pages, requires in-depth special knowledge and has some serious security issues.\r\nTo overcome these limitations, and to bring hardware system management to the present age, the Redfish management standard has been developed and released by the DMTF (Distributed Management Task Force).\r\nRedfish uses a RESTful interface, is used over HTTPS, and provides all data in the JSON format using ODATA schemas. Good news for devops and automation tools :-)\r\nIn this talk, Werner outlines the goals of Redfish and shows how it works using real-world examples. Don't miss this talk and start automating your server hardware the modern way.","persons":[{"id":277,"full_public_name":"Werner Fischer"}],"links":[]},{"id":372,"guid":"c656589e-26bd-48b2-ba55-d23441134ca7","logo":"/system/logos/372/medium/coala.png?1456689567","date":"2016-04-29T17:00:00+02:00","start":"17:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_372_-_en_-_f0_02_-_201604291700_-_static_code_analysis_for_all_languages_-_coala_-_sils","title":"Static Code Analysis for All Languages - coala!","subtitle":"Because Code Quality Matters","track":"(Software) Development","type":"lecture","language":"en","abstract":"coala is an application that makes it very easy, writing analysis for any programming language or even arbitrary textual data. It is a useful abstraction that provides a convenient user interface and takes away a lot of common tasks from the algorithm developer, effectively making bare research available for production use.\r\n\r\nThis talk features a short introduction into the thoughts behind coala, it's ability to speed up research as well as increase productivity and an interactive demonstration of our command line and other interfaces - bring a laptop or just watch the show!","description":"","persons":[{"id":298,"full_public_name":"sils"}],"links":[{"url":"http://coala-analyzer.org/","title":"coala Website"},{"url":"https://github.com/coala-analyzer/coala/","title":"coala Repository"}]},{"id":352,"guid":"7ced0a91-eeee-4031-9f45-566e7b930b56","logo":"/system/logos/352/medium/python-logo.png?1453231652","date":"2016-04-29T18:00:00+02:00","start":"18:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_352_-_de_-_f0_02_-_201604291800_-_python_for_mathematics_science_and_engineering_-_claus_aichinger","title":"Python for Mathematics, Science and Engineering","subtitle":"","track":"(Software) Development","type":"lecture","language":"de","abstract":"Du bekommst einen kurzen Überblick über das Scientific Computing \"Ökosystem\" in Python und welche Themenbereiche bzw. Fragen du damit angehen kannst.","description":"In den letzten Jahren hat sich der <a href=\"https://www.scipy.org/\">Scientific Stack</a> in Python zu einer ernsthaften Open Source Alternative zu etablierten proprietären Systemen wie beispielsweise <a href=\"http://mathworks.com/products/matlab\">MATLAB</a> entwickelt. Leider ist das umfangreiche Angebot an Möglichkeiten für Einsteiger oft ein wenig unübersichtlich - der Vortrag soll hier Abhilfe schaffen. \r\n\r\nWir besprechen:\r\n\r\n- Warum Scientific Computing mit Python? \r\n- Was gibt es da alles? \r\n- Wie fange ich an? \r\n- Wer verwendet das überhaupt? \r\n- Ist es wirklich so einfach? Ja! :) (zwei Beispiele)\r\n\r\nDas Vortragsmaterial wird im Anschluss an die Veranstaltung veröffentlicht.","persons":[{"id":213,"full_public_name":"Claus Aichinger"}],"links":[]}],"F2.01":[{"id":385,"guid":"e0b884cb-000d-4376-bb6c-c5dd4176acf9","logo":null,"date":"2016-04-29T10:00:00+02:00","start":"10:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_385_-_de_-_f2_01_-_201604291000_-_tacos_fur_alle_-_rina_ahmed","title":"TACOs für Alle","subtitle":"Cordova Entwicklung mit Visual Studio","track":"(Software) Development","type":"lecture","language":"de","abstract":"In diesem Vortrag werden die Tools for Apache Cordova (TACO) vorgestellt. Wir sehen an Demobeispielen, wie die Integration mit Visual Studio und Visual Studio Code funktioniert, um Cross-Plattform Apps in HTML/JS mit Apache Cordova zu entwickeln.","description":"","persons":[{"id":127,"full_public_name":"Rina Ahmed"}],"links":[]},{"id":348,"guid":"4e7b3f59-9d61-4de9-9396-e5c01488b093","logo":null,"date":"2016-04-29T11:00:00+02:00","start":"11:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_348_-_de_-_f2_01_-_201604291100_-_visual_studio_code_-_rainer_stropek","title":"Visual Studio Code","subtitle":"Microsofts IDE für alle Plattformen","track":"Programme und Tools","type":"lecture","language":"de","abstract":"Visual Studio verbindet man seit Jahren mit Windows. Der jüngste Spross in der VS-Familie, Visual Studio Code, ist jedoch anders. Diese IDE läuft auf Linux, MacOS und Windows, ist Open Source und unterstützt unterschiedlichste Programmiersprachen. In dieser Session stellt Azure MVP und Microsoft Regional Director Visual Studio Code unter Linux vor und zeigt, wie man damit C# und JavaScript/TypeScript Programme schreibt.","description":"","persons":[{"id":198,"full_public_name":"Rainer Stropek"}],"links":[]},{"id":412,"guid":"0bff19ce-697e-4086-82f5-e14385fb1fdc","logo":null,"date":"2016-04-29T12:00:00+02:00","start":"12:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_412_-_de_-_f2_01_-_201604291200_-_backend_in_der_cloud_-_thomas_mutzl","title":"Backend in der Cloud","subtitle":"API Apps und Logic Apps in Azure","track":"Cloud","type":"lecture","language":"de","abstract":"Microsoft Azure bietet einige PaaS (Platform-as-a-Service) Lösungen an, die für die unterschiedlichsten Anforderungen eines Backends geeignet sind. Zwei dieser Services, die sich ideal ergänzen, werden anhand einiger Demos näher vorgestellt:\r\n\r\nAPI Apps erlauben es, RESTful Services mit .NET zu entwickeln und in Azure zu hosten. Dank Swagger, einem Framework zur Schnittstellenbeschreibung von REST APIs, wird die Verwendung von API Apps jetzt noch einfacher. \r\n\r\nMit Logic Apps lassen sich Workflows in der Cloud definieren: in einem grafischen Designer werden eigene API Apps mit vordefinierten Triggern und Konnektoren kombiniert, um Geschäftsprozesse abzubilden, die dann automatisiert ausgeführt werden können.","description":"","persons":[{"id":126,"full_public_name":"Thomas Mutzl"}],"links":[]},{"id":384,"guid":"fef93b6f-83c5-4610-b9c4-64b32eb50f17","logo":null,"date":"2016-04-29T13:00:00+02:00","start":"13:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_384_-_de_-_f2_01_-_201604291300_-_die_offene_microsoft_plattformubergreifendes_alm_mit_visual_studio_-_oliver_lintner_-_gerwald_oberleitner","title":"Die offene Microsoft: Plattformübergreifendes ALM mit Visual Studio","subtitle":"","track":"(Software) Development","type":"lecture","language":"de","abstract":"\"Microsoft loves Open Source\": Unter dem neuen CEO S. Nadella wurde mit \"Mobile First, Cloud First\" eine neue Ära begonnen. Dies spiegelt sich auch in den Application Lifecycle Management (ALM) Werkzeugen wider. Grund genug sich die Werkzeuge und deren OSS Integration in dieser Session genauer anzusehen...","description":"Die heutige Technologielandschaft verlangt offene Tools die ohne Plattformvoraussetzungen zur Entwicklung, zum Testen, zur Gewinnung von Telemetriedaten, zum Betrieb oder zur Planung/Umsetzung von agilen Projekten eingesetz werden können. Der Vortrag bietet einen Überblick beginnend mit einem Code Editor (auch für Linux, Mac OS verfügbar), über Visual Studio bis hin zur web-basierten ALM Plattform Visual Studio Team Service. Einen Schwerpunkt setzt der Vortrag auf das Thema DevOps.","persons":[{"id":219,"full_public_name":"Oliver Lintner"},{"id":308,"full_public_name":"Gerwald Oberleitner"}],"links":[]},{"id":455,"guid":"32c79df3-d50d-4444-bca2-288d94249a70","logo":null,"date":"2016-04-29T14:00:00+02:00","start":"14:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_455_-_de_-_f2_01_-_201604291400_-_redhat_losungen_in_der_wolke_-_lutz_lange","title":"RedHat Lösungen in der Wolke","subtitle":"","track":null,"type":"lecture","language":"de","abstract":"Holen Sie sich das Beste aus beiden Welten. Fügen Sie Ihren Red Hat-Anwendungen die Leistung und Skalierungsmöglichkeiten von Azure hinzu, und profitieren Sie von der schnellen Bereitstellung in Azure – der flexiblen, zuverlässigen und offenen Cloudplattform. Holen Sie aus Ihren Red Hat-Investitionen das Beste heraus, mit einem Hybridbereitstellungsmodell, das Ihnen die Wahl lässt, wo Sie Ihre Anwendungen ausführen möchten: lokal oder in der Cloud.\r\n\r\nDa Microsoft Mitglied des Red Hat Certified Cloud & Service Provider Programmes ist, ist es einfach Red Hat Linux Lösungen auf Azure betreiben zu können. Ob nun bestehende Red Hat Subscriptions mittel Red Hat Cloud Access auf Azure gestartet werden, oder komplett neue Red Hat Umgebungen auf Azure gebaut werden. Das gemeinsame Support-Team dahinter garantiert die volle Unterstützung Ihrer Umgebung, ob es nun Red Hat Enterprise Linux, Red Hat JBoss Enterprise Application Server, Red Hat JBoss Enterprise Web Server, Red Hat Cluster Storage oder Red Hat OpenShift ist.\r\n\r\nMicrosoft loves Linux! Sie ist hier, die Partnerschaft, auf die Sie gewartet haben. Führen Sie Ihre Red Hat-Lösungen jetzt in Microsoft Azure aus.","description":"","persons":[{"id":335,"full_public_name":"Lutz Lange"}],"links":[]},{"id":347,"guid":"2e4b2b3f-3dd5-4841-ad80-66b7f50e7634","logo":null,"date":"2016-04-29T15:00:00+02:00","start":"15:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_347_-_de_-_f2_01_-_201604291500_-_c_und_net_unter_linux_-_rainer_stropek","title":"C# und .NET unter Linux","subtitle":"","track":"(Software) Development","type":"lecture","language":"de","abstract":"Mit ASP.NET 5 sprengen C# und .NET die Grenzen von Windows. Open Source und Plattformunabhängigkeit sind jetzt angesagt. In dieser Session zeigt Azure MVP und Microsoft Regional Director Rainer Stropek, wie man unter Linux mit C# und .NET entwickelt.","description":"","persons":[{"id":198,"full_public_name":"Rainer Stropek"}],"links":[]},{"id":389,"guid":"245d1309-fe7a-47dc-94ac-97e7c9911144","logo":null,"date":"2016-04-29T16:00:00+02:00","start":"16:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_389_-_de_-_f2_01_-_201604291600_-_build_and_deploy_javascript_web_apps_with_vsts_and_azure_-_raoul_holzer","title":"Build and Deploy JavaScript Web Apps with VSTS and Azure","subtitle":"","track":"(Software) Development","type":"lecture","language":"de","abstract":"Erklären wie JavaScript-basierte Webanwendungen mit dem neuen Microsoft Build 2015 System erstellt, getestet und deployed werden können.  Weiters wird gezeigt wie VSTS im allgemeinen funktioniert und wie agile Prozesse abgebildet sind. ","description":"","persons":[{"id":309,"full_public_name":"Raoul Holzer"}],"links":[]},{"id":382,"guid":"7ca2197f-01b0-42b0-b38c-3033275af944","logo":"/system/logos/382/medium/logo-title.png?1456872722","date":"2016-04-29T17:00:00+02:00","start":"17:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_382_-_en_-_f2_01_-_201604291700_-_jenkins_2_0_what_s_inside_-_oleg_nenashev","title":"Jenkins 2.0. What's inside?","subtitle":"Overview of the project and its status","track":"Programme und Tools","type":"lecture","language":"en","abstract":"The lecture is about <a href=\"http://jenkins-ci.org/\">Jenkins</a> automation server and the ongoing Jenkins 2.0 activity. The presentation provides a brief introduction to the current Jenkins project state, it's common weaknesses and ongoing activities within the community. After that, the main Jenkins 2.0 Jenkins changes will be presented (UX improvements, Pipeline-as-Code, etc.).","description":"Jenkins originally founded in 2006 as \"Hudson\", is one of the leading automation servers available. Using an extensible, plugin-based architecture developers have created hundreds of plugins to adapt Jenkins to a multitude of build, test, and deployment automation workloads. Jenkins core is open-source (MIT License). In 2015, Jenkins surpassed 100,000 known installations making it the most widely deployed automation server.\r\n<p/>\r\nIn 2016 the Jenkins project is planning to release Jenkins 2.0. This is a major effort targeting the user experience, which is known to be one of the main Jenkins weaknesses. It includes not only user interface changes, but also availability improvements and major new features. The activity involves all components of Jenkins: core, plugins, website and internal automation infrastructure.\r\n<p/>\r\nThe talk addresses major changes in Jenkins 2.0:\r\n<ul>\r\n <li/>Jenkins positioning shift: it goes beyond Continuous Integration (in particular, to Continuous Delivery and DevOps areas) \r\n <li/>User documentation and website improvements\r\n  <li/>User experience improvements: Installation experience, configuration pages, etc.\r\n  <li/>Pipeline-as-code: Pipeline ecosystem allowing to describe jobs in Groovy DSL located in SCMs \r\n<ul/>\r\n<p/>\r\nAfter the talk there will be a Q&A and live demo session regarding the incoming Jenkins features.","persons":[{"id":300,"full_public_name":"Oleg Nenashev"}],"links":[{"url":"https://jenkins-ci.org/","title":"Jenkins Website"},{"url":"https://wiki.jenkins-ci.org/display/JENKINS/Jenkins+2.0","title":"Jenkins 2.0 Wiki Page"},{"url":"https://wiki.jenkins-ci.org/display/JENKINS/2.0+Pipeline+as+Code","title":"Jenkins 2.0 Pipeline as Code"}]},{"id":444,"guid":"b9316b94-fbd4-428f-bad9-6cc99907ae63","logo":"/system/logos/444/medium/logo.png?1459507015","date":"2016-04-29T18:00:00+02:00","start":"18:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_444_-_en_-_f2_01_-_201604291800_-_jenkins_meetup_roundtable_-_oleg_nenashev","title":"Jenkins Meetup / Roundtable","subtitle":"Roundtable / Vienna Jenkins Area Meetup","track":"Programme und Tools","type":"workshop","language":"en","abstract":"We would like to conduct an additional workshop-alike session after the talk about Jenkins 2.0. This session will be conducted in a style of Jenkins Area Meetups (https://wiki.jenkins-ci.org/display/JENKINS/Jenkins+Area+Meetup) - 2-3 short talks about various Jenkins use-cases. We will focus on Linux-related topics. ","description":"Preliminary schedule:\r\n- Short intro presentation about JAMs. Call for being local organizers\r\n- Talks about various Jenkins use-cases\r\n- Round-table / Long QA session","persons":[{"id":300,"full_public_name":"Oleg Nenashev"}],"links":[{"url":"https://wiki.jenkins-ci.org/display/JENKINS/Jenkins+Area+Meetup","title":"Jenkins Area Meetups Wiki"},{"url":"http://www.meetup.com/pro/Jenkins/","title":"Jenkins Area Meetups Map"},{"url":"https://jenkins.io/index.html","title":"Jenkins Website"}]}],"EDV F1.01":[{"id":362,"guid":"ad328f1b-3a7a-4c4c-b308-f2f7cb148608","logo":null,"date":"2016-04-29T13:00:00+02:00","start":"13:00","duration":"05:00","room":"EDV F1.01","slug":"LWW16_-_362_-_de_-_edv_f1_01_-_201604291300_-_siem_mit_ossim_-_thomas_bleier","title":"SIEM mit OSSIM","subtitle":"Securiy Information and Event Management mit dem Open-Source SIEM OSSIM","track":"Privacy and Security","type":"workshop","language":"de","abstract":"Praktischer Workshop zu Security Information and Event Management (SIEM) mit einer Einführung in die Installation und Verwendung von OSSIM (einer Open-Source SIEM Lösung)","description":"SIEM (Security Information and Event Management) ist eine wichtige Komponenten aktueller IT-Sicherheitskonzepte, um zusätzlich zu klassichen protektiven Schutzmechanismen auch detektive und reaktive Komponenten zur effizienten Reaktion auf Angriffe zu etablieren. Neben vielen teuren kommerziellen Tools ist mit OSSIM (https://www.alienvault.com/products/ossim) auch eine Open-Source Variante einer solchen Software verfügbar, die einen kostengünstigen Einstieg ermöglicht. Der Workshop gibt einen Überblick über SIEM generell und den sinnvollen praktischen Einsatz solcher Software, und zeigt dann anhand von OSSIM konkret wie man sicherheitsrelevante Informationen sammelt, korreliert und aufbereitet.","persons":[{"id":128,"full_public_name":"Thomas Bleier"}],"links":[]}],"EDV F1.02":[{"id":410,"guid":"57306913-120d-4bbb-accc-461a46df8b5d","logo":"/system/logos/410/medium/GP_Logo_hires.png?1458244059","date":"2016-04-29T12:00:00+02:00","start":"12:00","duration":"01:00","room":"EDV F1.02","slug":"LWW16_-_410_-_en_-_edv_f1_02_-_201604291200_-_deliver_private_secure_android_apps_with_ease_-_hans-christoph_steiner","title":"Deliver private, secure Android apps with ease","subtitle":"use our free software libraries to handle the tricky bits","track":"Mobile Development","type":"workshop","language":"en","abstract":"","description":"Mobile phones have become central to our private lives, full of intimate messages, private pictures, and a huge amount of details of our personal lives. This private information can easily leak out in so many different ways, yet the user experience feels very private. When we look at our mobile screens, it feels like no one else can see what we are seeing unless we show them. Unfortunately, it is difficult for app developers to deliver on this implicit promise made to users.\r\n\r\nFor companies, we see that data about people can be very lucrative business. It is also increasingly apparent that having too much data about users can destroy your business if that information gets hacked and dumped onto the internet.\r\n\r\nBuilding apps that can securely contain private can be hard to do, but it does not have to be. Guardian Project’s central goal is to make it as easy as possible. We take cutting edge security research and bundle it up into free, easy to use libraries. These libraries make it very easy to protect precious data on the device and over the internet. These libraries use APIs that developers already know (e.g. android.database.*, java.io.*) so the ramp up time for developers is really fast. This workshop will give an overview of our suite of libraries, including SQLCipher-for-Android, private file stores, and hardened network connections. Then we will help you start incorporating them in your own apps, providing a wealth of examples including sample code, real world apps that use these libraries, and UI/UX patterns that work well.\r\n","persons":[{"id":316,"full_public_name":"Hans-Christoph Steiner"}],"links":[{"url":"https://guardianproject.info/code","title":"Guardian Project Libraries"}]},{"id":409,"guid":"578d7844-687c-4bb3-8253-e1c6f4089d5b","logo":"/system/logos/409/medium/ic_launcher.png?1458243206","date":"2016-04-29T13:00:00+02:00","start":"13:00","duration":"00:45","room":"EDV F1.02","slug":"LWW16_-_409_-_en_-_edv_f1_02_-_201604291300_-_f-droid_building_the_private_unblockable_app_store_-_hans-christoph_steiner","title":"F-Droid: building the private, unblockable app store","subtitle":"your app store does not need to know who you are","track":"Privacy and Security","type":"lecture","language":"en","abstract":"","description":"As app developers, we want to focus on making our apps better.  It is easy to delay thinking about security.  But exploits are now targeting developers, for example, XCodeGhost had a massive impact.  The F-Droid free developer tools make a secure process vastly easier, and with little change to your workflow, while providing automated uploading to Google Play and F-Droid when posting new apps, releases, their descriptions, and the translations.\r\n\r\nThere are also many things that can make it hard to get apps to users.  Google Play is blocked in some places, regional app stores are often cesspools of malware.  The internet can be disabled or even just plain expensive.  People turn to getting apps from websites, email, bluetooth, SD Cards, or any other method they can figure out. In China, the internet is ubiquitous but heavily filtered and monitored; but \"collateral freedom\" techniques have proven effective. In Vietnam, swapping apps with Bluetooth is widespread.  In Cuba, people get apps via mesh networks and by buying \"La Paquete\". These techniques work in many places, but none work in all, and it is very difficult to keep track of them all. This requires users, developers, companies, and organizations to be fluent in many technical details in order to effectively get and distribute mobile apps and media around the world.\r\n\r\nF-Droid includes all these techniques in system that is easy for developers to plug into. we are focused on providing a simple, smooth user experience, with three use cases in mind:\r\n\r\n* The end user gets a familiar app store experience, regardless of the complexity behind it all\r\n\r\n* The developer is in control of a simple set of commands that automate the entire distribution workflow for easily making highly secure builds, then getting apps out through all possible channels, including Google Play\r\n\r\n* Non-technical organizations and people can use these tools to publish curated collections of apps and media, without getting caught up in the technical details of the whole process.\r\n","persons":[{"id":316,"full_public_name":"Hans-Christoph Steiner"}],"links":[{"url":"https://f-droid.org","title":"F-Droid"},{"url":"https://guardianproject.info","title":"Guardian Project"}]},{"id":394,"guid":"cbcf25b0-fda9-47f0-8deb-c1063d31deac","logo":"/system/logos/394/medium/2016-03-08_21.58.03.png?1457470899","date":"2016-04-29T14:00:00+02:00","start":"14:00","duration":"02:00","room":"EDV F1.02","slug":"LWW16_-_394_-_de_-_edv_f1_02_-_201604291400_-_verwenden_statt_verschwenden_-_karl_exler","title":"Verwenden statt verschwenden","subtitle":"Wie sie Ihren \"alten\" Laptop unter Linux neues Leben einhauchen","track":"Open Everything","type":"workshop","language":"de","abstract":"Wie Sie mit Linux der Hardware-Kauffalle entrinnen.\r\nWie Sie Dank Linux auch hältere Hardware sehr fein weiterverwenden können","description":"Wirtschaft und Industrie wollen uns in immer kürzeren Zyklen neue Hardware verkaufen. Meist lange bevor die erst vor wenigen Jahren angeschafften Gerät kaputt geworden sind.\r\n\r\nFlankiert wird diese Bemühung durch immer neue Betriebssystem-Versionen, die immer wesentlich mehr Ressourcen benötigen als dir vorige Version. \r\n\r\nIn diesem Workshop wird gezeigt:\r\n<ul>\r\n<li>wie alte Hardware (älter als 7 Jahre) flüssig läuft, \r\n<li>die Software darauf dennoch unseren modernen Anforderungen entspricht, \r\n<li>sicher ist und \r\n<li>alle Funktionalitäten bietet, die der Großteil der Nutzer benötigt.\r\n</ul><p>\r\nDer Schwerpunkt dabei liegt auf den Funktionen Surfen, Mailen, Office, Audio, Video, Grafik, \r\n<a href=\"//www.linuxwochen.at/wien-ws-anmeldung\" style=\"font-weight: bold;\">Zur Workshop-Anmeldung</a>","persons":[{"id":214,"full_public_name":"Karl Exler"}],"links":[]}],"Sem F4.01":[{"id":350,"guid":"d6063b89-9c10-450c-b248-2a5f8c7fa71c","logo":null,"date":"2016-04-29T11:00:00+02:00","start":"11:00","duration":"02:00","room":"Sem F4.01","slug":"LWW16_-_350_-_de_-_sem_f4_01_-_201604291100_-_crowdfunding_workshop_-_sebastian_pichelhofer","title":"Crowdfunding Workshop","subtitle":"Spungbrett über den Abgrund","track":"Open Everything","type":"workshop","language":"de","abstract":"Workshop zum Vermitteln der essentiellen Informationen zur Vorbereitung und Durchführung einer Crowdfunding Kampagne. Realistisch abschätzen was zu erwarten ist. Dos and Donts aus Erfahrungen von jemanden der es wissen sollte :)","description":"Nachdem die Indiegogokampagne für die Entwicklung der AXIOM Beta Open Hardware und Free Software digital cinema camera 2014 mehr als 200% des Ziel erreicht hat und mit über 200.000€ zur damals erfolgreichsten österreichischen indiegogo kampagne aller zeiten angewachsen ist teilen die Macher jetzt ihr Wissen, Ihre Erfahrungen und die gelernten Tricks fürs Crowdfunding. \r\n\r\nNicht jedes Projekt ist für Crowdfunding geeignet und es gibt viele Details die zu beachten sind. Crowdfunding ist nicht nur Chance sondern auch Risiko. Dieser Workshop soll einem umfassenden Überblick geben auf was man sich beim Abenteuer Crowdfunding einlassen muss und dann viel Platz für Fragen, Diskussionen und die Projekte/Pläne der Teilnehmer bieten.","persons":[{"id":104,"full_public_name":"Sebastian Pichelhofer"}],"links":[]},{"id":371,"guid":"19dcab11-c299-4a36-972b-a33cad31c2c4","logo":"/system/logos/371/medium/freedombox.png?1456686258","date":"2016-04-29T13:00:00+02:00","start":"13:00","duration":"05:00","room":"Sem F4.01","slug":"LWW16_-_371_-_de_-_sem_f4_01_-_201604291300_-_freedombox_update_-_markus_sabadello","title":"FreedomBox Update!","subtitle":"mit Prototypen einer eigenen \"Danube Edition\"","track":"Privacy and Security","type":"workshop","language":"de","abstract":"Die FreedomBox ist ein persönlicher Server auf Linuxbasis, der die besten Ideen und Softwareprojekte für mehr Privatsphäre in einem Gerät vereint. Das Projekt wird von einer internationalen Open-Source Community betrieben. Es gibt auch in Österreich immer wieder Events und Aktivitäten rund um die FreedomBox, und wir haben einige Prototypen einer FreedomBox \"Danube Edition\" mit eigenen Erweiterungen.","description":"Das FreedomBox-Projekt wurde aus der Überlegung geboren, dass stark zentralisierte Internet-Dienste wie Google und Facebook eine enorme Ansammlung von persönlichen Daten zur Folge haben, was wiederum zu Kontrolle, Macht und Missbrauchspotenzial führt.Von FreedomBox-Gründer Eben Moglen stammt der Ausspruch, dass Facebook inzwischen mehr Daten über Menschen gesammelt hat, als das alle totalitären Regimen das 20. Jahrhunderts geschafft haben.\r\n\r\nWas kann die FreedomBox (bzw. was soll sie können)?\r\n\r\n-    Transparente Proxy-Funktion für Tor\r\n-    AdBlock (Blocken von Werbung und Tracking JavaScripts)\r\n-    HTTPS Everywhere\r\n-    VPN: Surfen über verschlüsselte Verbindung (z.B. von unsicherem WLAN) via FreedomBox\r\n -   VPN: Surfen mit anderer IP Adresse von zuhause via VPN Provider\r\n-    OwnCloud (Dropbox-Ersatz)\r\n-    MailPile (web-basierter e-mail client)\r\n-    XMPP-Server (für Instant Messaging)\r\n-    remoteStorage für “Unhosted” Anwendungen (“restore” oder “rs-serve”)\r\n-    Kontrollierter Datenaustausch mit “XDI” Protokoll\r\n-    Linked Data for Semantic Web\r\n-    Eigener Domainname und “IndieWeb” Technologien\r\n-    Hosten persönlicher Websites (Blog, Wiki, etc.)\r\n-    P2P-Netze (z.B. RetroShare)\r\n\r\nUnterstützte Hardware z.B.: Guruplug, Dreamplug, Raspberry Pi, BeagleBone, CubieTruck, etc.\r\n\r\nEs werden einige Freedombox-Prototypen beim Workshop zur Verfügung gestellt.\r\n","persons":[{"id":141,"full_public_name":"Markus Sabadello"}],"links":[{"url":"http://freedombox.at/","title":"freedombox.at"},{"url":"http://debian-dev.freedombox.at/","title":"freedombox.at Build Server"},{"url":"https://wiki.debian.org/FreedomBox/","title":"FreedomBox @ Debian"}]}],"Sem F4.02":[{"id":458,"guid":"d2fc0713-d882-4395-b9da-19e3aa822e03","logo":null,"date":"2016-04-29T11:00:00+02:00","start":"11:00","duration":"03:00","room":"Sem F4.02","slug":"LWW16_-_458_-__-_sem_f4_02_-_201604291100_-_deb_freitag_vormittag_-_christian_amsuess","title":"[deb] Freitag Vormittag","subtitle":"","track":null,"type":"meeting","language":"","abstract":"","description":"","persons":[{"id":279,"full_public_name":"Christian Amsuess"}],"links":[]},{"id":459,"guid":"abf25825-e84a-4b65-8123-1bb52d9c712e","logo":null,"date":"2016-04-29T14:00:00+02:00","start":"14:00","duration":"03:00","room":"Sem F4.02","slug":"LWW16_-_459_-__-_sem_f4_02_-_201604291400_-_deb_freitag_nachmittag_-_christian_amsuess","title":"[deb] Freitag Nachmittag","subtitle":"","track":null,"type":"meeting","language":"","abstract":"","description":"","persons":[{"id":279,"full_public_name":"Christian Amsuess"}],"links":[]}],"Sem F4.07":[{"id":419,"guid":"3d009502-f719-4e86-9115-ea7d9fbd559e","logo":null,"date":"2016-04-29T14:00:00+02:00","start":"14:00","duration":"03:00","room":"Sem F4.07","slug":"LWW16_-_419_-_de_-_sem_f4_07_-_201604291400_-_lpi_prufung","title":"LPI Prüfung","subtitle":"","track":null,"type":"other","language":"de","abstract":"LPI-Zertifizierungsprüfungen","description":"Details zu den Prüfungen sind der Homepage zu entnehmen: http://www.linuxwochen.at/wien-lpi","persons":[],"links":[]}]}},{"index":2,"date":"2016-04-30","day_start":"2016-04-30T10:00:00+02:00","day_end":"2016-04-30T17:00:00+02:00","rooms":{"F0.01":[{"id":423,"guid":"fd935908-cebd-4a41-a8a7-3d35bb8b599c","logo":"/system/logos/423/medium/0_A.D._logo.png?1458663779","date":"2016-04-30T10:00:00+02:00","start":"10:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_423_-_en_-_f0_01_-_201604301000_-_0_a_d_rts_game_-_how_open_source_works_for_us_-_jan_middelkoop","title":"0 A.D. RTS game - how open source works for us","subtitle":"A short description of the game, its development and what's in store for the future","track":"(Software) Development","type":"lecture","language":"en","abstract":"For people new to or already familiar with the most awesome open-source RTS game around.  We'll talk about what 0 A.D. is, how it came to be and why open-source games are important.\r\n\r\nYou'll learn about how the project almost died when it was in closed-source development, yet flourishes since going open-source.  Also, we'll give you a sneak preview for upcoming features and ways you can contribute to the game.  You'll get a behind the scenes look at how art, maps and mods are developed.\r\n\r\nIf you're interested in open-source development, computer games, or if you'd like to contribute to an awesome project like 0 A.D, but don't know where to start, this talk is for you.\r\n\r\nDuring and after the talk we welcome any questions you may have.  Questions can be asked in German.","description":"","persons":[{"id":146,"full_public_name":"Jan Middelkoop"}],"links":[{"url":"http://www.play0ad.com/","title":"Download & play 0 A.D."},{"url":"http://www.wildfiregames.com/","title":"Wildfire Games official website"}]},{"id":346,"guid":"c86f4fbc-794c-46c7-b777-a33f3e4654f7","logo":null,"date":"2016-04-30T11:00:00+02:00","start":"11:00","duration":"00:45","room":"F0.01","slug":"LWW16_-_346_-_de_-_f0_01_-_201604301100_-_from_closed_source_to_open_source_-_rudolf_grotz","title":"From Closed Source to Open Source ","subtitle":"Ab Morgen sparen wir jede Menge Kohle und Nerven","track":"Mobile Development","type":"lecture","language":"de","abstract":"Testautomationstools für mobile Anwendungen stecken 2015 noch in den Kinderschuhen, sind doch durch die Plattform Fragmentierung und die Einschränkungen der mobilen Betriebssysteme härtere Probleme zu lösen als für Webanwendungen. \r\nAus der Selenium Open Source Community kommt ein vielversprechender Ansatz.  EBAY’s iOS-Driver und Dominik Dary’s Selendroid, bzw. Sauce Labs Appium  sind am besten Weg Selenium erfolgreich in die mobile Welt zu überführen.    \r\nDer Vortrag zeigt an Hand eines Erfahrungsberichtes wie Jumio Inc. die anfänglich eingesetzten kommerziellen Testautomation-Tools für mobile Anwendungen durch Open Source Tools wie Selendroid, iOS-Driver, Robotium  & Co. ersetzt hat.  \r\nEs wird dargestellt welche Vorteile der Paradigmenshift von Closed Source und der Abhängigkeit von einem Anbieter, zum Open Source Modell und dem aktiven Teilnehmen am OSS-Leben brachte. \r\n","description":"Open Source vs. Closed Source\r\nKommerzielle Software, deren Lizenz von einem Software-Hersteller erworben wird,  wird Aufgrund des unzugänglichen Quellcode auch als Closed Source Software (CSS) bezeichnet. Im Gegensatz dazu, ist der Sourcecode von Open-Source-Software (OSS) öffentlich und kann an die Anforderungen eines Unternehmens, einer Organisation, einer Community oder eines Projekts angepasst werden. \r\n\r\nDie Grundidee hinter Open Source Software ist sehr einfach: Wenn Softwareentwickler den Quellcode der eingesetzten Software lesen, anpassen und vertreiben können, entwickelt sich das Produkt weiter. Entwickler verbessern das Produkt, passen es an neue Gegebenheiten und Anforderungen an,  oder beheben Bugs. Das alles passiert mit einer Geschwindigkeit, mit dem die schwerfälligen, langsamen Releases (Stichwort Change Request) von kommerziellen Software-Herstellern nicht mithalten können und diese alt ausschauen lassen.\r\n\r\nDie Open Source Community hat vorgezeigt, dass mit ihrem schnellen Evolutionsprozess bessere Software erzeugt, als das traditionelle geschlossene Modell. Allgemein bekannte Beispiele wie Android, Firefox und Selenium unterstreichen dieses.\r\n\r\nSelenium, iOS-Driver, Selendroid & Co. Für Testautomatisierung im Bereich Webanwendungen ist das Open Source Projekt Selenium das Maß aller Dinge, das von Thoughworks entwickelt und als freie Software unter der Apache-2.0-Lizenz veröffentlicht wurde. Hunderte von Code-Committern machen den Erfolg von Selenium aus, und geben der Open Source Idee Recht. Kein kommerzielles Tool kann ähnliche Erfolge aufweisen.  \r\n\r\nTestautomationstools für mobile Anwendungen stecken 2015 noch in den Kinderschuhen, sind doch durch die Plattform Fragmentierung und die Einschränkungen der mobilen Betriebssysteme härtere Probleme zu lösen.\r\n\r\nDie Lösung dafür kommt wieder aus dem Dunstkreis der Selenium Open Source Community. EBAY’s iOS-Driver und Dominik Dary’s Selendroid, bzw. Sauce Labs Appium  sind am besten Weg Selenium erfolgreich in die mobile Welt zu überführen.    \r\n\r\nJumio’s Mobile Continuous Delivery Pipeline powered by Open Source\r\nDer Vortrag zeigt an Hand eines Erfahrungsberichtes wie Jumio Inc. die anfänglich eingesetzten kommerziellen Testautomation-Tools für mobile Anwendungen durch Open Source Tools wie Selendroid, iOS-Driver, Robotium  & Co. ersetzt hat. \r\n\r\nSie lernen:\r\n1. welche Vorteile der Paradigmenshift von Closed Source und der Abhängigkeit von einem Anbieter, zum Open Source Modell bringt\r\n2. wie sie es schaffen, dass Entwickler gerne Tests automatisieren\r\n3. wie die aktive Teilnehme am OSS-Leben andere Unternehmensbereiche (Marketing, Verkauf…)  positiv beeinflusst.\r\n\r\n\r\n","persons":[{"id":268,"full_public_name":"Rudolf Grötz"}],"links":[]},{"id":424,"guid":"3fd16f10-e75e-41d2-8fba-9c1206f7467e","logo":"/system/logos/424/medium/0_A.D._logo.png?1458664929","date":"2016-04-30T11:45:00+02:00","start":"11:45","duration":"01:00","room":"F0.01","slug":"LWW16_-_424_-_en_-_f0_01_-_201604301145_-_qtalk_-_0_a_d_rts_game_-_development_challenges_-_jan_middelkoop","title":"QTalk - 0 A.D. RTS game - development challenges","subtitle":"Programming challenges while creating an open-source game with developers all over the world","track":"(Software) Development","type":"lecture","language":"en","abstract":"During the +15 years of development, there have been many challenges for the RTS game 0 A.D.  Seven years ago, the project's closed-source development stagnated.  Now, the open-source reincarnation of the project is reaching beta stage.\r\n\r\nIn this presentation we'll give an insight into how the game is developed, what problems there have been and how we overcame them.  We'll give you a thorough look under the hood at the game engine and you'll find out how we optimized the pathfinder, and how the multiplayer component works.\r\n\r\nIf you are interested in large open-source projects, game development, or if are you developing an open-source game yourself, this talk is for you.\r\n\r\nDuring and after the talk we welcome any questions you may have.  Questions can be asked in German.","description":"","persons":[{"id":146,"full_public_name":"Jan Middelkoop"}],"links":[{"url":"http://www.play0ad.com","title":"Download & play 0 A.D."},{"url":"http://www.wildfiregames.com/","title":"Wildfire Games official website"}]},{"id":399,"guid":"7c186778-d24a-4d08-a786-83715099ddeb","logo":"/system/logos/399/medium/trigger-rally.png?1457689561","date":"2016-04-30T12:45:00+02:00","start":"12:45","duration":"00:30","room":"F0.01","slug":"LWW16_-_399_-_de_-_f0_01_-_201604301245_-_trigger_rally_-_franz_gratzer","title":"Trigger Rally","subtitle":"Eine kleine Historie","track":"(Software) Development","type":"lecture","language":"de","abstract":"Vor einigen Jahren stieß ich auf der Suche nach einem Rally Spiel, das selbst auf meiner betagten Hardware noch läuft, auf Trigger Rally. Die bemerkenswerte Fahrphysik überzeugte mich sofort. Weil mir ein Rennen selbst nach vielen Versuchen noch zu schwer war, habe ich begonnen das Spiel anzupassen. Inzwischen bin ich einer der Haupt-Mitarbeiter.","description":"Im Vortrag stelle ich die Entwicklungsgeschichte des Spiels seit meiner Teilnahme vor und was alle dazu beitragen können.\r\n\r\nTrigger Rally befindet sich in den Standard-Quellen von Debian und Ubuntu. Es ist mittlerweile zu einer Rally-Simulation gewachsen, die viele interessante Funktionen wie Unterschiedliche Auto-Klassen und Untergrundmaterialien beitet ohne dafür Rückwärtskompatibilität zu opfern. Sobald die Hardware zumindest grundlegende 3D-Unterstützung hat, läuft das Spiel flüssig und performant.\r\n\r\nAb Version 0.6.4 können im Karriere-Modus neue Autos und zusätzliche Events freigeschalten werden. Im Einzelrenn-Modus können jeder Zeit alle Strecken gefahren werden, um die persönlichen Höchstzeiten zu verbessern. Das Spiel bietet gesprochene Beifahrer-Kommandos in verschiedenen Stimmen und Symbolen. Konfigurationseinstellungen in einem einfachen XML-Dokument erlauben eine unkomplizierte individuelle Anpassung des Spiels.\r\n\r\nAls ich das Spiel 2013 entdeckte, haben viele dieser Funktionen noch gefehlt. Inzwischen starte ich das Spiel meistens eher um eine weitere Strecke zu erstellen als um bloß nur zu spielen, einfach weil mich die Herausforderung reizt neue interessante Stecken zu erstellen.\r\n\r\nEs macht Spass etwas Relevantes zu einem Computerspiel beitragen zu können, das alle frei nutzen können. Zum Glück ist es bei Trigger Rally sehr einfach nützliche Ergänzungen beizusteuern. Wir freuen uns zwar natürlich über helfende Hände, die in C programmieren können, aber zum Erstellen neuer Strecken oder Autos ist das gar nicht nötig. In der Regel reicht es aus einen Texteditor und ein Bildbearbeitungsprogramm bedienen zu können.\r\n\r\nNeue Auto-Modelle können in Blender erstellt werden - auch wenn keine Texturen und Renderingeffekte exportiert werden können. Wir stellen auch neue Grafiken, die wir für das Spiel erstellen, in freien Spielentwicklungs-Ressource-Archiven zur Verfügung. Ein typisches Beispiel dafür sind Pflanzen-Sprites.","persons":[{"id":313,"full_public_name":"Franz Gratzer"}],"links":[{"url":"https://sourceforge.net/projects/trigger-rally/","title":"Trigger Rally"}]},{"id":425,"guid":"ee291bb6-7935-4fe9-bb68-b289eca45b4f","logo":"/system/logos/425/medium/osd_domotics_logo.png?1458813426","date":"2016-04-30T13:15:00+02:00","start":"13:15","duration":"00:45","room":"F0.01","slug":"LWW16_-_425_-_de_-_f0_01_-_201604301315_-_smart_sarah_-_h_pichler","title":"Smart Sarah","subtitle":"Smart Home System","track":"Open Hardware","type":"lecture","language":"de","abstract":"Die Community des Vorliegenden Projektes entwickeln eine offene Hardware und Softwareplattform, die es den Nutzern ermöglicht sein Smart-Home, seine Bulding-Automation, einfach und bequem zu Steuern.Zur Vernetzung der Aktoren und Sensoren dient IP.","description":"Die Community des Vorliegenden Projektes entwickeln zusammen eine offene Hardware und Softwareplattform, die es den Nutzern ermöglicht sein Smart-Home, seine Bulding-Automation, einfach und bequem zu Steuern. Eine Schlüsselrolle spielen moderne Kommunikationsgeräte wie Smart-Phones, Tabletts, Smart-TV und Webtechnologien. Zur Vernetzung der Aktoren und Sensoren dient IP. Die Software basiert auf Contiki-OS, Linux und OpenHAB, Linknx-Webknx und Open-Limbas für die Verbindung zwischen Building-Automation und Geschäftsprozessen. Smart-SARAH ist dank freier Lizenzen beliebig erweiterbar. Die Leitung des Projektes liegt bei der Opensource Domotics Group.\r\n\r\nIn allen Bereichen des Lebens werden wir zunehmend von Technik begleitet. Im Eigenheim hilft uns Smart-Home, energieeffizient zu wohnen und den Alltag  angenehmer zu gestalten. Das vorliegende Projekt entwickelt eine offene Hardware und Softwareplattform, die es den Nutzern ermöglicht, sein Zuhause einfach und bequem zu steuern. Eine Schlüsselrolle spielen moderne Kommunikationsgeräte wie Smart-Phones, Tablets, Smart-TV und Webtechnologien. Zur Vernetzung der Aktoren und Sensoren dient IP, die Software basiert auf Linux und Contiki-OS und ist dank freier Lizenzen beliebig erweiterbar.\r\n","persons":[{"id":38,"full_public_name":"H.Pichler"}],"links":[{"url":"http://wiki.osdomotics.com/doku.php/de:projekte:smart-sarah","title":"Smart-SARAH"},{"url":"http://wiki.osdomotics.com","title":"Smart-SARAH Hardware"}]},{"id":414,"guid":"21d6b317-2ab3-471b-a9e0-6a9edcf87804","logo":null,"date":"2016-04-30T14:15:00+02:00","start":"14:15","duration":"00:30","room":"F0.01","slug":"LWW16_-_414_-_de_-_f0_01_-_201604301415_-_eine_myoelektrisch_gesteuerte_prothese_aus_dem_3d-drucker_-_andreas_karolyi","title":"Eine Myoelektrisch gesteuerte Prothese aus dem 3D-Drucker","subtitle":"","track":"Open Hardware","type":"lecture","language":"de","abstract":"Durch die voranschreitende Entwicklung des 3D-Druckers wird dieser nicht nur in der Leistungsfähigkeit immer besser sondern auch in der Anschaffung immer günstiger. Somit findet er schön langsam seinen Einzug in vielen privaten Haushalten.    \r\n\r\nAuch in der Prothetik gewinnt der 3D-Drucker durch opensorce Projekten und die günstige Produktion für individuelle Anforderungen, zunehmend an Bedeutung. Elektronisch gesteuerte Prothesen sind in der Anschaffung meist zu teuer für den Patienten, auch wenn die Krankenkasse für einen teil der Kosten aufkommt. Doch durch die Verwendung des 3D-Drucks wurde bereits mehrfach bewiesen, dass es durchaus möglich ist eine preiswerte Prothese zu produzieren. Das Ziel meines Projektes war die Entwicklung einer myoelektrisch gesteuerte Armprothese mit Herstellungskosten unter 500€.  Dabei habe ich auch auf eine etwas andere Technik der Steuerung gesetzt.","description":"","persons":[{"id":319,"full_public_name":"Andreas Karolyi"}],"links":[]},{"id":351,"guid":"47036676-af5b-4fc0-a927-d6c4f6efe82f","logo":null,"date":"2016-04-30T15:00:00+02:00","start":"15:00","duration":"00:45","room":"F0.01","slug":"LWW16_-_351_-_de_-_f0_01_-_201604301500_-_axiom_beta_-_offene_kinokamera_-_sebastian_pichelhofer","title":"AXIOM Beta - offene Kinokamera","subtitle":"Bericht nach 2 Jahren Entwicklung","track":"Video / Audio","type":"lecture","language":"de","abstract":"Die AXIOM Beta ist die erste Open Hardware und Free Software digitale Kinofilmproduktionskamera und wurde 2014 erfolgreich gecrowdfundet. Ein Bericht über den aktuellen Entwicklungsfortschritt und die Lessons Learnt. ","description":"Die AXIOM Beta Hardware Entwicklung ist mit Ende 2015 abgeschlossen. Der Fokus verschiebt sich auf Produktion/Fertigung, Qualtitätssicherung und Software-Entwicklung. Ein Bericht über die Lessons Learnt mit Crowdfunding, EU Innovationsförderung, Technische Challenges, und die Reibungsflächen mit der Closed-Source Konkurrenz. Warum der Osborne effekt immer ein Problem ist und wo die Zukunft des Projekts liegt. Dieser Vortrag verspricht Aufklärung.","persons":[{"id":104,"full_public_name":"Sebastian Pichelhofer"}],"links":[]},{"id":379,"guid":"b8d91a80-6fd8-4ef6-93f9-1c5b088cfd8b","logo":"/system/logos/379/medium/Coreboot_full_quadratic.png?1456793585","date":"2016-04-30T16:00:00+02:00","start":"16:00","duration":"01:00","room":"F0.01","slug":"LWW16_-_379_-_de_-_f0_01_-_201604301600_-_the_bumpy_road_to_open_pc_firmware_-_stefan_tauner","title":"The bumpy road to open PC firmware","subtitle":"Wie das coreboot-Projekt deinen PC befreit","track":"Open Hardware","type":"lecture","language":"de","abstract":"Sowohl auf Betriebssystem-Ebene als auch bei Anwendungen ist Open-Source-Software nicht mehr wegzudenken.\r\nIn Hardware-näheren Bereichen wie Firmware ist es jedoch weiterhin schwierig, offene Systeme zu verwenden.\r\nDieser Vortrag beschäftigt sich mit der Funktionsweise des offenen Firmware-Projektes coreboot, sowie den technischen als auch den (Firmen-)politischen Problemen, die bei dessen Entwicklung zu lösen sind.","description":"Als die Entwicklung von coreboot 1999 unter dem Namen LinuxBIOS zum Betrieb von Rechen-Clustern am Los Alamos National Laboratory begann, ahnte niemand, dass es einmal Millionen von Consumer-Laptops antreiben würde.\r\nAusnahmslos alle aktuellen Modelle von Google's Chromebooks verwenden die offene Firmware als Grundlage für den schnellen und sicheren Start des Betriebssystems.\r\nDarüber hinaus kann man die proprietäre Firmware verschiedener Embedded-, Server- und Desktop-Mainboards, sowie diverser Thinkpads und sogar Macbooks mit coreboot ersetzen.\r\n<br/>\r\n<br/>\r\nDer Vortrag beschreibt,\r\n<ul>\r\n<li>was in modernen PCs und Laptops zwischen dem Druck auf die Einschalttaste und dem Laden des Betriebssystem passiert,</li>\r\n<li>was coreboot zu bieten hat,</li>\r\n<li>wie die Entwicklung von coreboot vor sich geht,</li>\r\n<li>nähere Details zum Programm flashrom, mit dem man auf den Flash-Speicher der Firmware zugreifen kann.</li>\r\n</ul>","persons":[{"id":208,"full_public_name":"Stefan Tauner"}],"links":[{"url":"https://www.coreboot.org","title":"coreboot-Homepage"},{"url":"https://www.flashrom.org","title":"flashrom-Homepage"}]}],"F0.02":[{"id":380,"guid":"2ac16543-a948-4cac-a115-e62a33cbf9f7","logo":null,"date":"2016-04-30T10:00:00+02:00","start":"10:00","duration":"01:00","room":"F0.02","slug":"LWW16_-_380_-_de_-_f0_02_-_201604301000_-_wir_basteln_mit_dem_pinguin_-_roman_weissgarber","title":"Wir basteln mit dem Pinguin!","subtitle":"Linux Gadgets.","track":"Open Hardware","type":"lecture","language":"de","abstract":"Viele der Entwicklungsboards mit ARM Prozessor wie z.B. der Raspberry Pi Zero besitzen einen USB-Anschhluss der nicht nur im Host-Modus sondern auch als USB Pheripherie benutzt werden kann. Damit lässt sich einfach eine Verbindung zu einem anderen Computer herstellen. Verschiedene Anwendungen können so realisiert werden: vom Booten des Boards bis hin zur Netzwerkanbindung.\r\n","description":"Wir werden uns mit den Möglichkeiten die GNU/Linux im allgemeinen und der Linux Kernel im speziellen zur Realisierung von USB Pheripherie/Gadget Systemen bietet auseinandersetzen. \r\nAnhand von ein paar Beispielen betrachten wir wie aktuelle Entwicklungsboards mit ARM Prozessoren mit so einer Gadget-Schnittstelle gebootet bzw. genutzt werden können.\r\n","persons":[{"id":56,"full_public_name":"Roman Weissgärber"}],"links":[]},{"id":440,"guid":"e99d56e9-2f33-4008-8d58-9c0533d1ea80","logo":null,"date":"2016-04-30T11:00:00+02:00","start":"11:00","duration":"01:00","room":"F0.02","slug":"LWW16_-_440_-_en_-_f0_02_-_201604301100_-_digital_forensics_in_linux_the_good_the_bad_and_the_ugly_-_martin_schmiedecker","title":"Digital forensics in Linux: The good, the bad and the ugly","subtitle":"","track":"Programme und Tools","type":"lecture","language":"en","abstract":"Digital forensics under Linux has a long tradition, and plenty of tools are available that prefer it as the underlying operating system e.g. dd, volatility, Sleuth Kit and others.\r\n\r\nThis talk will cover some of the recently released tools which take forensics to a whole new level, and how they can be used in digital investigations. In particular these tools are bulk_extractor, hashdb, as well as open-source monitoring frameworks that allow to run investigations with 10+ systems: GRR, MIG and osquery. ","description":"","persons":[{"id":334,"full_public_name":"Martin Schmiedecker"}],"links":[]},{"id":406,"guid":"d6c19480-be3d-4153-b151-a176138a6089","logo":null,"date":"2016-04-30T12:00:00+02:00","start":"12:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_406_-_en_-_f0_02_-_201604301200_-_innovations_in_the_debian_project_-_martin_michlmayr","title":"Innovations in the Debian project","subtitle":"","track":"Open Everything","type":"lecture","language":"en","abstract":"This talks covers important changes in the Debian project over the last few years.\r\n","description":"","persons":[{"id":307,"full_public_name":"Martin Michlmayr"}],"links":[]},{"id":398,"guid":"0c2b4a9d-d747-4843-885e-c774fd8ca4b0","logo":"/system/logos/398/medium/sat.png?1457633459","date":"2016-04-30T13:00:00+02:00","start":"13:00","duration":"00:45","room":"F0.02","slug":"LWW16_-_398_-_en_-_f0_02_-_201604301300_-_salut_a_toi_and_libervia_-_souliane","title":"Salut à Toi and Libervia","subtitle":"Ethical and decentralised social network","track":"Cloud","type":"lecture","language":"en","abstract":"Presentation of the XMPP-based communication tool Salut à Toi and its web frontend Libervia.","description":"Salut à Toi aims to offer a free (as in freedom) and ethical alternative to the major social networks. We want to combine what has made the success of the email network (decentralized, standard and open protocol) with modern features and ease of use.\r\n\r\nWe have chosen to build our software over XMPP (ex Jabber), because it's a mature and extensible protocol - its publish subscribe feature contains all the bricks you need to build a real social network.\r\n\r\nSalut à Toi is also multi frontend, we currently have a web interface called Libervia but those who feel more comfortable with it will enjoy our console interface Primitivus. Not to forget the command line interface Jp that can be used for scripting or system administration.\r\n\r\nDuring the last months, we improved the blogging engine, the file transfer and many other things. We will soon start to work on a new interface for both desktops and Android devices.\r\n\r\nIt takes two seconds to say that a project is free and ethical only for marketing purpose, but we take these words seriously. During the lecture we will also talk about the political aspect of Salut à Toi and the choices we made to keep the project on the right tracks.","persons":[{"id":312,"full_public_name":"souliane"}],"links":[{"url":"http://salut-a-toi.org","title":"Salut à Toi"},{"url":"https://libervia.org","title":"Libervia"}]},{"id":427,"guid":"d9f8db05-4142-4cc8-9780-96223a2df903","logo":null,"date":"2016-04-30T15:00:00+02:00","start":"15:00","duration":"02:00","room":"F0.02","slug":"LWW16_-_427_-__-_f0_02_-_201604301500_-_minidebcon_block_2","title":"miniDebCon Block 2","subtitle":"block","track":null,"type":"other","language":"","abstract":"","description":"","persons":[],"links":[]}],"F2.01":[{"id":393,"guid":"74b14c5c-628b-43fe-baea-7aeb1c782fd1","logo":null,"date":"2016-04-30T10:00:00+02:00","start":"10:00","duration":"00:45","room":"F2.01","slug":"LWW16_-_393_-__-_f2_01_-_201604301000_-_the_new_html_-_markdown_-_use_plain_text_for_websites_presentations_and_books_-_gerald_bauer","title":"The New HTML - Markdown - Use Plain Text  for Websites, Presentations and Books","subtitle":"A free plain text alternative to Word, Pages, LibreOffice, KeyNote, Powerpoint, LaTeX, etc.","track":"Open Everything","type":"lecture","language":"","abstract":"Use the free plain text markup formatting conventions united under the markdown umbrella -offering an easy-to-write and\r\neasy-to-read format - to author and build web site, presentations, books and more. Markdown is the \"new HTML\" and offers a free alternative to Word, Pages, LibreOffice, KeyNote, Powerpoint, and more. ","description":"Use the free plain text markup formatting conventions united under the markdown umbrella -offering an easy-to-write and\r\neasy-to-read format - to author and build web site, presentations, books and more. Markdown is the \"new HTML\" and offers a free alternative to Word, Pages, LibreOffice, KeyNote, Powerpoint, and more. ","persons":[{"id":57,"full_public_name":"Gerald Bauer"}],"links":[]},{"id":388,"guid":"252f3d43-e942-4113-98da-8e8c10c779e1","logo":null,"date":"2016-04-30T11:00:00+02:00","start":"11:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_388_-_de_-_f2_01_-_201604301100_-_container_fur_desktops_-_robert_matzinger","title":"Container für Desktops","subtitle":"Privacy und Security mit LXC et.al., auch auf Desktop-Maschinen","track":"Privacy and Security","type":"lecture","language":"de","abstract":"Wie man Containertechnologie wie LXC, Docker, etc. auch auf dem eigenen Desktop Computer bzw. Notebook nutzen kann, um Privacy und Datensicherheit beim Surfen im Netz und bei vielen anderen Aktivitäten entscheidend zu erhöhen.","description":"Egal wo wir surfen, liken und followen, immer bleibt das unangenehme Gefühl, dass man erstens eine gewaltige Datenspur im Netz hinterlässt und dass man zweitens den immer wieder vorkommenden Sicherheitslücken von Web-Browser, Plugins, etc. schutzlos ausgeliefert ist.\r\n\r\nAbhilfe würde eine zusätzliche Virtualisierungs-Schutzschicht bieten, die aber auf (kleinen) Notebooks und Desktop-Maschinen aus Performance- und Usability-Gründen meist nicht praxistauglich ist.\r\n\r\nDoch \"Lightweight Virtualization\" aka Containertechnologien wie LXC et. al., wie sie als Technologie für Server des Cloud-Zeitalters entwickelt wurde, ist auch für (kleine) Desktop-Computer ein ideales Tool um zusätzliche Schutzschichten in die eigenen Software-Installation einzuziehen und Angreifer und Datensammler aus dem Netz abzuwehren.\r\n\r\nIn diesem Talk geben wir eine Anleitung, wie man mit LXC et. al. auch auf kleinen Computern und Desktops die Installation von Web-Browser, Proxy und anderen exponierten Tools sicher kapseln kann - und das transparent für den User und ohne Performance-Verlust.\r\n\r\nDas erhöht nicht nur Security und Privacy, es vereinfacht auch das Testen und Portieren von Installationen und erleichtert uns die Arbeit beim Installieren und Verwalten unserer Rechner.","persons":[{"id":54,"full_public_name":"Robert Matzinger"}],"links":[]},{"id":397,"guid":"fe06ffed-2f33-4254-9bc9-8e35452ac874","logo":null,"date":"2016-04-30T12:00:00+02:00","start":"12:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_397_-_de_-_f2_01_-_201604301200_-_raspberry_goes_cloud_and_windows_10_-_andreas_schabus","title":"Raspberry goes Cloud and Windows 10","subtitle":"","track":"Cloud","type":"lecture","language":"de","abstract":"Internet of Things (IoT) hat sich in den letzten Jahren zu einem Schlagwort mit vielen unterschiedlichen Bedeutungen entwickelt. Für manche bedeutet es in erster Linie Spaß an der Technik, für andere stehen aber sehr konkrete Business Ziele im Vordergrund; z.B. bei Industrie 4.0.\r\nIm \"Client Teil\" dieses Vortrages geht es darum, wie man auf einem Raspberry Pi Windows IoT Core als Betriebssystem einsetzen kann.\r\nIm \"Server Teil\" beschäftigen wir uns mit den \"IoT Services\" von Microsoft Azure, die unabhängig vom Client Betriebssystem - sofern ein solches überhaupt eingesetzt wird - in Kombination mit Linux und Windows basierten Bausteinen für die Umsetzung von IoT Lösungen verwendet werden können.","description":"","persons":[{"id":311,"full_public_name":"Andreas Schabus"}],"links":[]},{"id":363,"guid":"ee2b5d2e-5ffb-4f4d-b2b1-56d4595c74aa","logo":null,"date":"2016-04-30T13:00:00+02:00","start":"13:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_363_-_de_-_f2_01_-_201604301300_-_asp_net_core_1_0_-_christian_nagel","title":"ASP.NET Core 1.0","subtitle":"Microsoft .NET unter Linux","track":"(Software) Development","type":"lecture","language":"de","abstract":"Microsoft's .NET Technologien supported unter Linux. Noch nie war Microsoft so offen wie heute. .NET ist Open Source und verfügbar unter Windows, Linux und OS-X. Diese Session Zeigt die Foundation von ASP.NET Core 1.0 mit den dotnet Tools und NuGet.","description":".NET Core ist die neue Version von Microsofts .NET – Open Source und verfügbar unter Windows, OS-X und Linux. Mit ASP.NET Core gibt es Web Technologien zur Entwicklung von Web Applikationen und Services. Neben Microsoft Tools setzt Microsoft auch auf die Integration von bower, NPM, und Gulp. Dependency Injection ist bereits in .NET integriert und erlaubt es die Applikation mit möglichst wenig Overhead zu betreiben. In dieser Session wird gezeigt was ASP.NET Core 1.0 und .NET Core 1.0 auszeichnet, wie auch die dotnet tool und NuGet eingesetzt werden können, und damit schließlich .NET Web Applikationen unter Linux laufen.","persons":[{"id":288,"full_public_name":"Christian Nagel"}],"links":[]},{"id":390,"guid":"dd538af3-b443-4e7b-8535-1f9859e0582e","logo":null,"date":"2016-04-30T14:00:00+02:00","start":"14:00","duration":"01:00","room":"F2.01","slug":"LWW16_-_390_-_de_-_f2_01_-_201604301400_-_angularjs_2_-_david_leitner","title":"AngularJS 2","subtitle":"","track":"(Software) Development","type":"lecture","language":"de","abstract":"Angular ist mittlerweile ein wichtiger Bestandteil moderner und wartbarer Webentwicklung geworden, weshalb man sich spätestens seit dem ersten Beta Release, mit der völlig überarbeiteten zweiten Version des Frameworks auseinandersetzen sollte.","description":"Angular hat wohl einen großen Anteil daran, dass das lange belächelte JavaScript mittlerweile als ernst zu nehmende Programmieralternative wahrgenommen wird und Single-Page-Applications auch für komplexe Businessanwendungen salonfähig sind. Nun liefert Google mit der Beta von Angular 2 einen würdigen Nachfolger seines Frameworks. Durch die Verwendung von Typescript und neuer Designkonzepte ist nicht mehr viel übrig vom charmanten JS Framework von einst, weshalb wohl eher von einer Neuentwicklung die Rede sein muss.\r\n\r\nDas Ziel dieser Session ist es eben diese neuen Features von Angular 2 vorzustellen und zu erklären. Aber auf die wichtigsten Konzepte und Frameworks der JS Infrastruktur (Transpiler, Taskrunner, Modulsysteme oder Packagemanagement) mit welcher man sich im Zuge eines Angular 2 Projekt zwangsweise auseinandersetzen muss, werden beleuchtet und näher gebracht.\r\nZu guter Letzt wird ein Überblick des aktuellen Status von Angular 2 der Roadmap und der Sinnhaftigkeit eines Einsatzes der aktuellen Beta Version geben. \r\n\r\nInhalte: Angular 2, Typescript, NodeJS, NPM, (Bower), Grunt, Gulp, Browsersync, CommonJS, RequireJS, Webpack \r\n\r\n","persons":[{"id":318,"full_public_name":"David Leitner"}],"links":[]},{"id":392,"guid":"0002b4b7-6bc3-4f93-b3f6-c93f3a197ce3","logo":null,"date":"2016-04-30T15:00:00+02:00","start":"15:00","duration":"00:45","room":"F2.01","slug":"LWW16_-_392_-_de_-_f2_01_-_201604301500_-_building_web_sites_single-page_apps_or_online_books_w_static_site_builders_generators_-_gerald_bauer","title":"Building Web Sites, Single-Page Apps or  Online Books w/ Static Site Builders / Generators","subtitle":"Metalsmith - Jekyll - Middleman - Hugo","track":"Programme und Tools","type":"lecture","language":"de","abstract":"Shows how to use (free, open source) static site builders / generators (such as Metalmsith (JavaScript/Node.js), Jekyll, Middleman (Ruby) or Hugo (Go)  to build static (web) sites or (single-page web) apps or  books.","description":"In 2016 you can get pretty far with just HTML, JS and CSS. The talk shows how to use (free, open source) static site builders / generators (such as Metalmsith (JavaScript/Node.js), Jekyll, Middleman (Ruby) or Hugo (Go)  to build static (web) sites or (single-page web) apps or  books. ","persons":[{"id":57,"full_public_name":"Gerald Bauer"}],"links":[]},{"id":404,"guid":"31227b86-6dca-47b6-9584-704dc2717c7a","logo":null,"date":"2016-04-30T16:00:00+02:00","start":"16:00","duration":"00:30","room":"F2.01","slug":"LWW16_-_404_-_en_-_f2_01_-_201604301600_-_javascript_does_not_offer_zero-cost_abstractions_-_arpad_borsos","title":"JavaScript does *not* offer zero-cost abstractions!","subtitle":"","track":"(Software) Development","type":"lecture","language":"en","abstract":"This will be a short talk about JavaScript and its shortcoming regarding performance and abstractions. The talk will show short examples but is mainly focused on raising awareness.","description":"","persons":[{"id":237,"full_public_name":"Arpad Borsos"}],"links":[]}],"EDV F1.01":[{"id":374,"guid":"ed3f4da3-0ebb-49f4-929b-ddb965f13fe7","logo":"/system/logos/374/medium/coala.png?1456695068","date":"2016-04-30T11:00:00+02:00","start":"11:00","duration":"03:00","room":"EDV F1.01","slug":"LWW16_-_374_-_en_-_edv_f1_01_-_201604301100_-_contributing_to_an_open_source_project_-_sils","title":"Contributing to an Open Source Project","subtitle":"On the example of coala","track":"(Software) Development","type":"workshop","language":"en","abstract":"In this workshop you will do a contribution to a real open source project. You will learn about communication channels, some git skills including the rebase and do a real contribution to coala. We will close with some opportunities for you to contribute to other projects and create your own flourishing community while scaling your project without breaking it.","description":"","persons":[{"id":298,"full_public_name":"sils"}],"links":[{"url":"http://coala-analyzer.org/","title":"The coala project"},{"url":"http://blog.redridge.me/contributing-to-coala/","title":"Experiences of a Newcomer"},{"url":"http://viperdev.io/","title":"Viper Development (Sponsor)"}]},{"id":400,"guid":"018f22b8-c635-4212-9081-9a6809996794","logo":"/system/logos/400/medium/trigger-rally.png?1457690582","date":"2016-04-30T14:00:00+02:00","start":"14:00","duration":"02:00","room":"EDV F1.01","slug":"LWW16_-_400_-_de_-_edv_f1_01_-_201604301400_-_eine_neue_strecke_fur_trigger_rally_-_franz_gratzer","title":"Eine neue Strecke für Trigger Rally","subtitle":"Wir erstellen neue Strecken für das freie Rally Spiel","track":"(Software) Development","type":"workshop","language":"de","abstract":"Wir erstellen neue Rennstrecken, die in Triger Rally gefahren werden können. Im Workshop lernen alle Teilnehmenden die Grundlagen für die Entwicklung. Ich gebe auch bisher undokumentierte praktische Tipps aus Jahre langer Erfahrung. Anschließend können alle Ihre Werke im Spiel testen.","description":"Neue Rennstecken können für Trigger Rally grudsätzlich in nur wenigen Minuten erstellt werden. Doch wer gezielt seine Ideen verwirklichen will und Wert darauf legt, dass die estellten Strecken ebenso spannend wie motivierend zu fahren sind, kann auch durchaus eine ganze Woche an einer Strecke tüfteln.\r\n\r\nVoraussetzungen dafür sind im Grunde nur ein einigermaßen typisches Bildbearbeitungsprogramm (wie GIMP), ein Vektorbearbeitungsprogramm (wie Inkscape) und ein simpler Texteditor.\r\n\r\nIm Workshop erstellen alle Teilnehmenden nach eigenen Vorstellungen eine neue Strecke.","persons":[{"id":313,"full_public_name":"Franz Gratzer"}],"links":[]}],"EDV F1.02":[{"id":436,"guid":"d637073f-81de-41a0-bcba-744e2912cf97","logo":null,"date":"2016-04-30T12:00:00+02:00","start":"12:00","duration":"02:00","room":"EDV F1.02","slug":"LWW16_-_436_-__-_edv_f1_02_-_201604301200_-_darktable_-_sebastian_wagner","title":"Darktable","subtitle":"Die digitale Open-Source Dunkelkammer ","track":"Programme und Tools","type":"workshop","language":"","abstract":"In diesem Workshop werden wir uns die Funktionen der digitalen Dunkelkammer beschäftigen. Beginnend mit dem Importieren und Verwalten über das Bedienen der Dunkelkammer-Module bis hin zum Exportieren gehen wir den ganzen Arbeitsablauf durch.","description":"Darktable ist innerhalb von wenigen Jahren zu einem der führenden Fotoausarbeitungsprogrammen geworden unter den unixoiden Betriebssystemen geworden. Ein wichtiger Grund ist der große Umfang Modulen zur Bildmanipulation, die einerseits einfach und intuitiv zu bedienenden sind, andererseits auch einen hohen professionellen Anspruch haben. In diesem Workshop werden wir den Workflow den uns das Programm bietet anhand einiger Beispiele gemeinsam durchprobieren und legen dabei den Fokus auf die Bedienung und Funktionalitäten des Programms.\r\n\r\nGrober Umriss der Themen:\r\n* Überblick über die Funktionen des Lighttables (Importieren von Bildern, Was sind Film rolls, Exportieren, Taggen)\r\n* Vorstellung der Funktionsweise der Dunkelkammer (Darkroom)\r\n* Module: Equalizer, Shadows and highlights, histogram, Masken, multi instance und einige mehr (auch gerne nach Bedarf)\r\n\r\nUnd zwischendurch nicht-zu-technische Erklärungen, wie Darktable hinter der Fassade arbeitet.\r\n\r\nGerne können auch eigene Bilder mitgebracht werden, die wir uns dann im Workshop ansehen werden.","persons":[{"id":120,"full_public_name":"Sebastian Wagner"}],"links":[{"url":"http://www.darktable.org/","title":"Darktable Website"}]},{"id":438,"guid":"6bf92229-3e91-4771-89d3-0a97dde92b19","logo":null,"date":"2016-04-30T14:00:00+02:00","start":"14:00","duration":"02:00","room":"EDV F1.02","slug":"LWW16_-_438_-__-_edv_f1_02_-_201604301400_-_python_workshop_-_thomas_perl","title":"Python Workshop","subtitle":"Generatoren & Co.","track":"(Software) Development","type":"workshop","language":"","abstract":"","description":"","persons":[{"id":233,"full_public_name":"Thomas Perl"}],"links":[]}],"Sem F4.01":[],"Sem F4.02":[],"Sem F4.07":[{"id":420,"guid":"dd31f404-9ece-4009-a244-d7b8a6c90a23","logo":null,"date":"2016-04-30T14:00:00+02:00","start":"14:00","duration":"03:00","room":"Sem F4.07","slug":"LWW16_-_420_-_de_-_sem_f4_07_-_201604301400_-_lpi_prufung","title":"LPI Prüfung","subtitle":"","track":null,"type":"other","language":"de","abstract":"LPI-Zertifizierungsprüfungen","description":"Details zu den Prüfungen sind der Homepage zu entnehmen: http://www.linuxwochen.at/wien-lpi\r\n","persons":[],"links":[]}]}}]}}}